Repository: ajkaijanaho/dctrl-tools
Catalog: man/po4a/po/*.po
Languages: de, fr

source: Conflicting atom modifiers were used; for example, perhaps both B<-X> and B<-e> were specified for the same atom.
de: Widersprüchliche Suchteilbestimmungswörter wurden benutzt; vielleicht wurden beispielsweise B<-X> und B<-e> für den gleichen Teil der Suche angegeben.
fr: Des modificateurs de filtres élémentaires incompatibles ont été utilisés. Par exemple, peut-être que B<-X> et B<-e> ont été indiqués pour le même filtre élémentaire.

source: B<missing ')' in command line>
de: B<fehlende »)« in der Befehlszeile
fr: B<« ) » manquante sur la ligne de commande>

source: There were more opening than closing parentheses in the given predicate.
de: Im angegebenen Prädikat waren mehr öffnende als schließende Klammern.
fr: Il y avait plus de parenthèses ouvrantes que fermantes dans le filtre donné.

source: B<no such log level>
de: B<keine derartige Protokollierungsstufe>
fr: B<niveau de journalisation « %s » inexistant>

source: The argument to B<-l> was invalid.
de: Das Argument für B<-l> war ungültig.
fr: L'argument de B<-l> n'était pas valable.

source: B<predicate is too complex>
de: B<Prädikat ist zu komplex>
fr: B<le prédicat est trop complexe>

source: The predicate's complexity (the number of atoms and connectives) exceed compile-time limits.
de: Die Komplexität des Prädikats (die Anzahl der Suchteile und Verbindungen) überschreitet die Beschränkungen zur Kompilierzeit.
fr: La complexité du filtre (le nombre de filtres élémentaires et de combinaisons) dépasse les limites de compilation.

source: B<read failure or out of memory>
de: B<Lesen fehlgeschlagen oder der Hauptspeicher reicht nicht aus>
fr: B<erreur de lecture ou manque de mémoire>

source: There was a problem reading the configuration file. Maybe there was a transput error; maybe memory was exhausted. This error may be transient, that is, if you try again, all may go well.
de: Es gab ein Problem beim Lesen der Konfigurationsdatei. Vieleicht kam es zu einem Transput-Fehler; möglicherweise war der Speicher erschöpft. Dieser Fehler ist vorübergehend, das heißt, falls Sie es erneut versuchen, könnte alles klappen.
fr: Un problème est survenu lors de la lecture du fichier de configuration. Ce peut être dû à une erreur d'entrée sortie, ou une surconsommation de mémoire. Ce peut être une erreur passagère, ainsi, en recommençant, elle peut ne pas réapparaître.

source: B<syntax error: need a executable name>
de: B<Syntax-Fehler: Name einer ausführbaren Datei benötigt>
fr: B<erreur de syntaxe : nécessite un nom d'exécutable>

source: There is a problem in the configuration file. Look, and you shall find it.
de: Es gab ein Problem in der Konfigurationsdatei. Sehen Sie nach und Sie werden es finden.
fr: Un problème existe dans le fichier de configuration. Regardez-le, et vous devriez la trouver.

source: B<syntax error: need an input file name>
de: B<Syntax-Fehler: Name der Eingabedatei benötigt>
fr: B<erreur de syntaxe : nécessite un nom de fichier d'entrée>

source: B<too many file names>
de: B<zu viele Dateinamen>
fr: B<trop de noms de fichiers>

source: The number of file names specified in the command line exceeded a compile-time limit.
de: Die Anzahl der auf der Befehlszeile angegebenen Dateinamen überschritt eine Beschränkung zur Kompilierzeit.
fr: Le nombre de fichiers indiqués sur la ligne de commande dépasse les limites de compilation.

source: B<too many output fields>
de: B<zu viele Ausgabefelder>
fr: B<trop de champs de sortie>

source: The argument to B<-s> had too many field names in it. This number is limited to 256.
de: Das Argument B<-s> enthielt zu viele Dateinamen. Diese Anzahl ist auf 256 begrenzt.
fr: L'argument de B<-s> contenait trop de noms de fichier. Ce nombre est limité à 256.

source: B<unexpected ')' in command line>
de: B<unerwartete »)« in der Befehlszeile>
fr: B<« ) » inattendue sur la ligne de commande>

source: There was no opening parenthesis that would match some closing parenthesis in the command line.
de: Es gab keine öffnenden Klammern, die zu den schließenden Klammern in der Befehlszeile passten.
fr: Il n'y avait pas de parenthèse ouvrante correspondant à une des parenthèses fermantes de la ligne de commande.

source: COMPATIBILITY
de: KOMPATIBILITÄT
fr: COMPATIBILITÉ

source: If you use B<grep-dctrl> in a Debian package, it should depend on the B<dctrl-tools> package and heed the following compatibility notes:
de: Falls Sie B<grep-dctrl> in einem Debian-Paket verwenden, sollte es vom Paket B<dctrl-tools> abhängen und Sie sollten die folgenden Kompatibilitätshinweise beherzigen:
fr: Si vous utilisez B<grep-dctrl> dans un paquet Debian, il devrait dépendre du paquet B<dctrl-tools> et tenir compte des notes de compatibilité suivantes :

source: Always call only the B<grep-dctrl> executable
de: Rufen Sie nur die ausführbare Datei B<grep-dctrl> auf.
fr: Toujours appeler exclusivement l'exécutable B<grep-dctrl>

source: Although the B<grep-status> and B<grep-available> symlinks are installed by default, this may change in the future. Those symlinks are meant for manual and not scripted use.
de: Obwohl die symbolischen Verweise B<grep-status> and B<grep-available> standardmäßig installiert sind, könnte sich dies in Zukunft ändern. Diese symbolischen Verweise sind für den manuellen Gebrauch und nicht für Skripte gedacht.
fr: Même si les liens symboliques B<grep-status> et B<grep-available> sont installés par défaut, cela pourrait changer dans l'avenir. Ces liens symboliques sont destinés à l'utilisation directe et non pour les scripts.

source: Always specify an explicit file name
de: Geben Sie immer einen eindeutigen Dateiamen an.
fr: Toujours indiquer un nom de fichier explicite

source: Don't rely on the implicit file name feature. The system administrator may have changed the default file name. You should always specify the B<-> file, too.
de: Verlassen Sie sich nicht auf die implizite Dateinamensfunktion. Der Systemadministrator könnte den vorgegebenen Dateinamen geändert haben. Sie sollten auch immer die Datei B<-> angeben.
fr: Ne comptez pas sur la fonctionnalité de nom de fichier implicite. L'administrateur système peut avoir modifié le nom de fichier par défaut. Vous devriez aussi toujours indiquer le fichier B<->.

source: Not all features have been with us in every version
de: Nicht alle Funktionen waren in jeder Version vorhanden.
fr: Les fonctionnalités n'ont pas toujours été présentes suivant les versions

source: Check if any of the features you use is mentioned in the changelog. Use a versioned dependency on B<dctrl-tools>, if it is necessary.
de: Prüfen Sie, ob eine der von Ihnen benutzten Funktionen im Änderungsprotokoll erwähnt wird. Verwenden Sie eine Abhängigkeit mit einer bestimmten Version zu B<dctrl-tools>, falls dies nötig ist.
fr: Vérifier si toutes les fonctionnalités utilisées sont indiquées dans le journal de modifications. Utilisez une dépendance sur la version de B<dctrl-tools> si nécessaire.

source: FILES
de: DATEIEN
fr: FICHIERS

source: See the next file.
de: Siehe nächste Datei.
fr: Consultez le fichier suivant.

source: These files are the default configuration files for B<grep-dctrl>. The format is line-based, with `B<#>' introducing a comment that lasts to the end of the line. Each line defines one association between a program name and a default input file. These two things are listed in the line in order, separated by whitespace. Empty lines are ignored.
de: Diese Dateien sind die Standardkonfigurationsdateien von B<grep-dctrl>. Das Format ist zeilenbasiert. »B<#>« leitet einen Kommentar ein, der bis zum Ende der Zeile reicht. Jede Zeile definiert eine Verbindung zwischen einem Programmnamen und einer Standardeingabedatei. Diese beiden Zeichenketten sind in der Zeile hintereinander aufgeführt, durch Leerzeichen getrennt. Leere Zeilen werden ignoriert.
fr: Ces fichiers sont les fichiers de configuration par défaut de B<grep-dctrl>. Le format est composé de lignes indépendantes, avec « B<#> » pour introduire un commentaire jusqu'à la fin de la ligne. Chaque ligne définit une association entre un nom de programme et un fichier d'entrée par défaut, dans cet ordre, séparés par une espace. Les lignes vides sont ignorées.

source: If the default input file name starts with two at (B<@>) signs, one of them is ignored. This allows specifying a file name that starts with an at sign. If it starts with the string B<@exec>, the rest of the name is interpreted as a command name that is fed to B</bin/sh> B<-c>, and the standard output stream is used as the default input.
de: Falls der Name der Standardeingabedatei mit zwei At-Zeichen (B<@>) beginnt, wird eines davon ignoriert. Dies ermöglicht die Angabe eines Dateinamens, der mit einem At-Zeichen anfängt. Falls er mit der Zeichenkette B<@exec> beginnt, wird der Rest des Namens als Befehlsname interpretiert, der von B</bin/sh> B<-c> gespeist wird und der Standardausgabe-Datenstrom wird als Standardeingabe benutzt.
fr: Si le nom du fichier d'entrée par défaut commence par deux arobase (B<@>), l'une d'elles est ignorée. Cela permet d'indiquer un nom de fichier qui commence avec une arobase. S'il commence par la chaîne B<@exec>, le reste du nom est interprété comme un nom de commande qui est fournie à B</bin/sh> B<-c>, et le flux d'entrée standard est utilisé comme entrée par défaut.

source: The default input file of B<grep-available> when the shipped configuration is in effect.
de: die vorgegebene Eingabedatei von B<grep-available>, wenn die mitgelieferte Konfiguration in Kraft ist
fr: Le fichier d'entrée par défaut de B<grep-available> quand la configuration d'origine est utilisée.

source: The default input file of B<grep-status> when the shipped configuration is in effect.
de: die vorgegebene Eingabedatei von B<grep-status>, wenn die mitgelieferte Konfiguration in Kraft ist
fr: Le fichier d'entrée par défaut de B<grep-status> quand la configuration d'origine est utilisée.

source: AUTHOR
de: AUTOR
fr: AUTEUR

source: The program and this manual page were written by Antti-Juhani Kaijanaho E<lt>I<gaia@iki.fi>E<gt>. Bill Allombert E<lt>I<ballombe@debian.org>E<gt> provided one of the examples in the manual page.
de: Das Programm und diese Handbuchseite wurden von Antti-Juhani Kaijanaho E<lt>I<gaia@iki.fi>E<gt> geschrieben. Bill Allombert E<lt>I<ballombe@debian.org>E<gt> stellte eines der Beispiele in der Handbuchseite bereit.
fr: Le programme et cette page de manuel ont été écrits par Antti-Juhani Kaijanaho E<lt>I<gaia@iki.fi>E<gt>. Bill Allombert E<lt>I<ballombe@debian.org>E<gt> a fourni un des exemples de la page de manuel.

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI

source: Debian Policy Manual. Published as the Debian package B<debian-policy>. Also available in the Debian website.
de: Debian-Richtlinien-Handbuch (Debian Policy Manual) – herausgegeben als Debian-Paket B<debian-policy> – außerdem auf der Debian-Website verfügbar
fr: La Charte Debian. Publiée dans le paquet Debian B<debian-policy>. Également disponible sur le site de Debian.

source: B<ara>(1), B<apt-cache>(1), B<dpkg>(8), B<dpkg-awk>(1), B<sgrep>(1)
de: B<ara>(1), B<apt-cache>(1), B<dpkg-awk>(1), B<sgrep>(1), B<dpkg>(8)

source: join-dctrl - perform relational join on data in dctrl format
de: join-dctrl - stellt eine Beziehungsverknüpfung zu Daten im Dctrl-Format her
fr: join-dctrl - Réaliser des jointures relationnelles de données au format dctrl

source: B<join-dctrl> [ I<options> ] I<filename> I<filename>
de: B<join-dctrl> [ I<Optionen> ] I<Dateiname> I<Dateiname>
fr: B<join-dctrl> [ I<options> ] I<fichier> I<fichier>

source: B<join-dctrl> performs a relational join operation on data given to it in Debian control file format.
de: B<join-dctrl> führt anhand von Beziehungen eine Verknüpfungsoperation zu Daten her, die im Debian-Steuerdateiformat vorliegen.
fr: B<join-dctrl> réalise une opération de jointure relationnelle sur des données au format de fichiers de contrôle Debian.

source: A I<join field> must be specified using either the switches B<-1> and B<-2> or the switch B<-j>.
de: Ein I<Verknüpfungsfeld> muss unter Benutzung der Schalter B<-1>, B<-2> oder B<-j> angegeben werden.
fr: Un I<champ de jointure> doit être indiqué en utilisant soit les options B<-1> et B<-2>, soit l'option B<-j>.

source: Conceptually, the program creates all ordered pairs of records that can be formed by having a record from the first file as the first member of the pair and having a record from the second file as the second member of the pair; and then it deletes all such pairs where the join fields are not equal.
de: Begrifflich erstellt das Programm alle gegliederten Datensatzpaare, die aus einem Datensatz der ersten Datei als erstes und einem einem Datensatz der zweiten Datei als zweites Mitglied des Paares gebildet werden können; dann löscht es all die Paare, bei denen die Verbindungsfelder nicht gleich sind.
fr: Conceptuellement, le programme crée toutes les paires ordonnées d'enregistrement qui peuvent être formées en ayant un enregistrement du premier fichier comme premier membre de la paire et un enregistrement du second fichier comme second membre de la paire ; puis il supprime toutes les paires où les champs de jointure ne sont pas égaux.

source: Effectively, each of the input files is treated as a relational database table.
de: Im Grunde wird jede Eingabedatei als relationale Datenbanktabelle betrachtet.
fr: En réalité, tous les fichiers d'entrée sont traités comme des tables de base de données relationnelle.

source: Every input file must be in ascending order on its join field; this allows the program to work fast.
de: Jede Eingabedatei muss in ihrem Verbindungsfeld in aufsteigender Reihenfolge sortiert sein, damit das Programm schnell arbeiten kann.
fr: Tous les fichiers d'entrée doivent être dans l'ordre croissant de leur champ de jointure ; cela permet au programme de fonctionner plus rapidement.

source: The B<sort-dctrl>(1) program can be used to make it so.
de: Dazu kann das Programm B<sort-dctrl>(1) verwandt werden.
fr: Le programme B<sort-dctrl>(1) peut-être utilisé pour ce faire.

source: B<-1 >I<field>, B<--1st-join-field=>I<field>
de: B<-1 >I<Feld>, B<--1st-join-field=>I<Feld>
fr: B<-1> I<champ>, B<--1st-join-field=>I<champ>

source: Specify the join I<field> of the first input file.
de: gibt das Verbindungs-I<Feld> der ersten Eingabedatei an.
fr: Indiquer le I<champ> de jointure du premier fichier d'entrée.

source: B<-2 >I<field>, B<--2nd-join-field=>I<field>
de: B<-2 >I<Feld>, B<--2nd-join-field=>I<Feld>
fr: B<-2> I<champ>, B<--2nd-join-field=>I<champ>

source: Specify the join I<field> of the second input file.
de: gibt das Verbindungs-I<Feld> der zweiten Eingabedatei an.
fr: Indiquer le I<champ> de jointure du second fichier d'entrée.

source: B<-j >I<field>, B<--join-field=>I<field>
de: B<-j >I<Feld>, B<--join-field=>I<Feld>
fr: B<-j >I<champ>, B<--join-field=>I<champ>

source: Specify a common join I<field> for all files.
de: gibt das übliche Verbindungs-I<Feld> für alle Dateien an.
fr: Indiquer un I<champ> de jointure commun pour tous les fichiers.

source: B<-a >I<fileno>, B<--unpairable-from=>I<fileno>
de: B<-a >I<Dateinummer>, B<--unpairable-from=>I<Dateinummer>
fr: B<-a >I<nofichier>, B<--unpairable-from=>I<nofichier>

source: Specify that unmatched paragraphs from the first (if B<1> is given) or the second (if B<2> is given) file are printed.
de: gibt an, dass nicht passende Abschnitte von der ersten (falls B<1> angegeben ist) oder der zweiten (falls B<2> angegeben ist) Datei ausgegeben werden.
fr: Indiquer que les paragraphes non correspondants du premier (si B<1> est donné) ou du second (si B<2> est donné) fichier doivent être affichés.

source: B<-o >I<fieldspec>, B<--output-fields=>I<fieldspec>
de: B<-o >I<Feldangabe>, B<--output-fields=>I<Feldangabe>
fr: B<-o >I<specchamp>, B<--output-fields=>I<specchamp>

source: Specify which fields are included in the output.
de: gibt an, welche Felder in die Ausgabe einfließen.
fr: Indiquer quels champs sont inclus dans la sortie.

source: Fields are separated by commas (more than one B<-o> option can be used, too).
de: Felder werden durch Kommas getrennt (es kann auch mehr als eine B<-o>-Option benutzt werden).
fr: Les champs sont séparés par des virgules (plus d'une option B<-o> peut aussi être utilisée).

source: Each field is specified in the format I<fileno>B<.>I<field> in which I<fileno> is the ordinal number of the input file from which the field is drawn (either B<1> or B<2>), and I<field> gives the name of the field to use.
de: Jedes Feld wird im Format I<Dateinummer>B<.>I<Feld> angegeben, wobei I<Dateinummer> die Aufzählungsnummer der Eingabedatei ist, von der das Feld abgerufen wird (entweder B<1> oder B<2>) und I<Feld> gibt den Namen des zu verwendenden Feldes an.
fr: Chaque champ est indiqué au format I<nofichier>B<.>I<champ> dans lequel I<nofichier> est le numéro du fichier d'entrée duquel le champ est tiré (soit B<1> soit B<2>), et I<champ> donne le nom du champ à utiliser.

source: As a special case, simple B<0> can be used instead of I<fileno>B<.>I<field> to refer to the common value of the join fields.
de: Als Sonderfall kann einfach B<0> anstelle von I<Dateinummer>B<.>I<Feld> benutzt werden, um Bezug auf den üblichen Wert der Verbindungsfelder zu nehmen.
fr: En particulier, un simple B<0> peut être utilisé à la place de I<nofichier>B<.>I<champ> pour faire référence à la valeur commune des champs de jointure.

source: The name of the field (not including the file number) is used in the output as the name of the field.
de: Der Name des Feldes (der nicht die Dateinummer einschließt) wird in der Ausgabe als Name des Feldes benutzt.
fr: Le nom du champ (numéro de fichier non compris) est utilisé dans la sortie comme nom du champ.

source: However, a different name for output purposes can be specified by suffixing the field specification by a colon and the preferred visible name.
de: Zu Ausgabezwecken kann jedoch ein anderer Name durch Anhängen eines Doppelpunkts und des bevorzugten sichtbaren Namens an die Feldangabe angegeben werden.
fr: Cependant, un nom différent spécifique à la sortie peut être indiqué en ajoutant après l'indication du champ un deux-points suivi du nom choisi pour l'affichage.

source: For example, the option B<-o 0,1.Version:Old-Version,2.Version> specifies that the first field in any output record should be the join field, the second field should be B<Old-Version> drawing its data from the B<Version> field of the first input file, and the third field should be B<Version> drawing its data from the field with the same name in the second input file, and these are the only fields in an output record.
de: Die Option B<-o 0,1.Version:Alte-Version,2.Version> gibt zum Beispiel an, dass das erste Feld in jeder Ausgabe das Verbindungsfeld sein sollte, das zweite Feld sollte B<Alte-Version> sein und seine Daten vom Feld B<Version> der ersten Eingabedatei beziehen und das dritte Feld sollte B<Version> sein und seine Daten von dem Feld mit gleichem Namen in der zweiten Eingabedatei beziehen. Dies sind die einzigen Felder im Ausgabedatensatz.
fr: Par exemple, l'option B<-o 0,1.Version:Ancienne-Version,2.Version> indique que le premier champ de n'importe quel enregistrement en sortie devra-t-être le champ de jointure, le deuxième champ devra-t-être B<Ancienne-Version> dont les données sont tirées du champ B<Version> du premier fichier d'entrée, et le troisième champ devra-t-être le champ B<Version> dont les données sont tirées du champ de même nom dans le second fichier d'entrée, et ce sont les seuls champs affichés en sortie.

source: If no B<-o> option is given, all fields of all the records being joined are included in the output.
de: Falls die Option B<-o> angegeben wurde, werden alle Felder aller Datensätze, die verknüpft sind, in die Ausgabe einfließen.
fr: Si aucune option B<-o> n'est données, tous les champs de tous les enregistrements joints sont inclus dans la sortie.

source: OPERANDS
de: OPERANDEN
fr: OPÉRANDES

source: B<join-dctrl> will treat each file named on the command line as a relational database table.
de: B<join-dctrl> wird jede Datei, die auf der Befehlszeile benannt wird, als relationale Datenbanktabelle betrachten.
fr: B<join-dctrl> traitera chaque fichier nommé sur la ligne de commande comme une table de base de données relationnelle.

source: A file called B<-> represents the program's standard input stream.
de: Eine Datei namens B<-> steht für den Standardeingabe-Datenstrom eines Programms.
fr: Un fichier appelé B<-> représente le flux d'entrée standard du programme.

source: Currently, exactly two files must be named.
de: Derzeit müssen exakt zwei Dateien benannt werden.
fr: Actuellement, exactement deux fichiers doivent être nommés.

source: The standard input stream may be used as input as specified above in the B<OPERANDS> section.
de: Wie im vorhergehenden Abschnitt B<OPERANDEN> angegeben, könnte der Standardeingabe-Datenstrom als Eingabe verwandt werden.
fr: Le flux d'entrée standard peut être utilisé comme entrée du programme conformément à l'indication précédente dans la section B<OPÉRANDES>.

source: INPUT FILES
de: EINGABEDATEIEN
fr: FICHIERS D'ENTRÉE

source: All input to B<join-dctrl> is in the format of a Debian control file.
de: Jegliche Eingabe für B<join-dctrl> hat das Format einer Debian-Steuerdatei.
fr: Toutes les entrées de B<join-dctrl> sont au format d'un fichier de contrôle Debian.

source: A Debian control (dctrl) file is a semistructured single-table database stored in a machine-parseable text file.
de: Eine Debian-Steuerdatei (dctrl) ist eine halbwags strukturierte Datenbank aus einer Tabelle, die in einer maschinenauswertbaren Textdatei gespeichert wird.
fr: Un fichier de contrôle Debian (dctrl) est une base de donnée semi-structurée avec une seule table conservée dans un fichier texte analysable par une machine.

source: Such a database consists of a set of records; each record is a mapping from field names to field content.
de: Einer derartige Datenbank besteht aus einer Zusammenstellung von Datensätzen; jeder Datensatz ist eine Abbildung von Feldnamen auf Feldinhalt.
fr: Une telle base est constituée d'un ensemble d'enregistrements ; chaque enregistrement est une association de noms de champ et de contenus de champ.

source: Textually, records are separated by empty lines, while each field is encoded as one or more nonempty lines inside a record.
de: Textlich werden Datensätze durch leere Zeilen getrennt, während jedes Feld als eine oder mehrere nicht leere Zeilen innerhalb eines Datensatzes kodiert ist.
fr: Le fichier texte présente les enregistrements séparés par des lignes vides, tandis que chaque champ est constitué d'une ou plusieurs lignes non vides à l'intérieur d'un enregistrement.

source: A field starts with its name, followed by a colon, followed by the field content.
de: Ein Feld beginnt mit seinem Namen, gefolgt von einem Doppelpunkt, gefolgt vom Feldinhalt.
fr: Un champ commence par son nom, suivi d'un deux-points, suivi par le contenu du champ.

source: The colon must reside on the first line of the field, and the first line must start with no whitespace.
de: Der Doppelpunkt muss in der ersten Zeile des Feldes liegen und die erste Zeile darf nicht mit einem Leerraum beginnen.
fr: Les deux-points doivent rester sur la première ligne du champ, et la première ligne ne doit pas commencer par un espace.

source: Subsequent lines, in contrast, always start with linear whitespace (one or more space or tab characters).
de: In Gegensatz dazu beginnen nachfolgende Zeilen immer mit einem Leerraum (einem oder mehrere Leerzeichen oder Tabulatoren).
fr: Les lignes suivantes, au contraire, doivent commencer par un espace (un ou plusieurs caractères espace ou tabulation).
