Repository: ajkaijanaho/dctrl-tools
Catalog: man/po4a/po/*.po
Languages: de, fr

source: Each input file must be in the ascending order of its join field.
de: Jede Eingabedatei muss in aufsteigender Reihenfolge ihres Verbindungsfelds sortiert sein.
fr: Chaque fichier d'entrée doit être dans l'ordre croissant de son champ de jointure.

source: ENVIRONMENT VARIABLES
de: UMGEBUNGSVARIABLEN
fr: VARIABLES D'ENVIRONNEMENT

source: The standard locale environment, specifically its character set setting, affects the interpretation of input and output as character streams.
de: Die Standardsprachumgebung, insbesondere deren Zeichensatzeinstellung, beeinflusst die Interpretation der Ein- und Ausgabe als Zeichendatenströme.
fr: Les paramètres régionaux de d'environnement, en particulier la configuration du jeu de caractères, a une incidence sur l'interprétation des flux de caractères en entrée et en sortie.

source: ASYNCHRONOUS EVENTS
de: ASYNCHRONE EREIGNISSE
fr: ÉVÉNEMENTS ASYNCHRONES

source: Standard UNIX signals have their usual meaning.
de: Standard-UNIX-Signale haben ihre gewohnte Bedeutung.
fr: Les signaux UNIX normalisés ont leur signification habituelle.

source: All output is sent to the standard output stream.
de: Die komplette Ausgabe wird an den Standardausgabe-Datenstrom gesandt.
fr: Toute la sortie est envoyée sur le flux de sortie standard.

source: The output is in the format of a Debian control file, described above in the B<INPUT FILES> section.
de: Die Ausgabe hat das Format einer Debian-Steuerdatei, wie sie im vorhergehenden Abschnitt B<EINGABEDATEIEN> beschrieben wurde.
fr: La sortie est au format d'un fichier de contrôle Debian, précédemment décrit dans la section B<FICHIERS D'ENTRÉE>.

source: The output will be in the ascending order of the join field, if that field is included in the output.
de: Die Ausgabe wird in absteigender Reihenfolge des Verbindungsfelds sortiert, falls es in der Ausgabe enthalten ist.
fr: La sortie sera dans l'ordre croissant de son champ de jointure, si ce champ est inclus dans la sortie.

source: OUTPUT FILES
de: AUSGABEDATEIEN
fr: FICHIERS DE SORTIE

source: There are no output files.
de: Es gibt dort keine Ausgabedateien.
fr: Il n'y a aucun fichier de sortie.

source: This utility exits with B<0> when successful. It uses a nonzero exit code inconsistently when an error is noticed (this is a bug).
de: Dieses Hilfswerkzeug wird bei Erfolg mit B<0> beendet. Es benutzt inkonsistent einen Rückgaberwert ungleich Null, wenn ein Fehler festgestellt wird (dies ist ein Programmfehler).
fr: Cet utilitaire renvoie B<0> lors d'une exécution réussie. Un code de retour non nul incohérent est renvoyé si une erreur est détectée (c'est un bogue).

source: CONSEQUENCES OF ERRORS
de: FOLGEN VON FEHLERN
fr: CONSÉQUENCE DES ERREURS

source: In case of errors in the input, the output will be partially or completely garbage. In case of errors in invocation, the program will refuse to function.
de: Im Fall von Fehlern in der Eingabe wird die Ausgabe teilweise oder komplett Müll sein. Im Fall von Fehlern im Aufruf wird das Programm die Funktion verweigern.
fr: En cas d'erreur en entrée, la sortie sera partiellement ou complètement incorrecte. En cas d'erreur d'appel, le programme refusera de fonctionner.

source: Suppose that a file containing data about binary packages for the AMD64 architecture contained in the Debian squeeze (6.0) release, section B<main>, is in the current directory and named I<Packages>.
de: Angenommen, diese Datei enthält Daten über Binärpakete für die AMD64-Architektur, die in der Debian-Squeeze-Veröffentlichung (6.0) im Abschnitt B<main> enthalten sind. Sie liegt im aktuellen Verzeichnis und heißt I<Packages>.
fr: Soit un fichier contenant des données de paquets binaires pour l'architecture AMD64 de la publication Squeeze de Debian (6.0), section B<main>, nommé I<Packages> dans le répertoire actuel.

source: Suppose that we are currently on a Debian system.
de: Angenommen, es wird derzeit auf einem Debian-System gearbeitet.
fr: Supposons que les commandes sont exécutées sur un système Debian.

source: Suppose further that the current directory does not contain files named I<stat> and I<pkg>.
de: Außerdem angenommen, dass das aktuelle Verzeichnis keine Dateien mit Namen I<stat> und I<pkg> enthält.
fr: Supposons de plus qu'aucun fichier I<stat> ni I<pkg> n'est déjà présent dans le répertoire actuel.

source: The following commands gives, for each package currently installed and available in Debian squeeze (6.0), its currently installed version (as Old-Version) and the version in squeeze (as New-Version):
de: Die folgenden Befehle geben für jedes derzeit installierte und verfügbare Paket in Debian-Squeeze (6.0) seine installierte Version (als Alte-Version) und die Version in Squeeze (als Neue-Version) aus:
fr: Les commandes suivantes donnent, pour chaque paquet actuellement installé et disponible dans Debian Squeeze (6.0), la version actuellement installée (en tant qu'B<Ancienne-Version>) et la version de Squeeze (en tant que B<Nouvelle-Version>) :

source: $ sort-dctrl -kPackage /var/lib/dpkg/status E<gt> stat $ sort-dctrl -kPackage Packages E<gt> pkg $ join-dctrl -j Package \e -o 0,1.Version:Old-Version,2.Version:New-Version \e stat pkg
de: $ sort-dctrl -kPackage /var/lib/dpkg/status E<gt> stat $ sort-dctrl -kPackage Packages E<gt> pkg $ join-dctrl -j Package \e -o 0,1.Version:Alte-Version,2.Version:Neue-Version \e stat pkg
fr: $ sort-dctrl -kPackage /var/lib/dpkg/status E<gt> stat $ sort-dctrl -kPackage Packages E<gt> pkg $ join-dctrl -j Package \e -o 0,1.Version:Ancienne-Version,2.Version:Nouvelle-Version \e stat pkg

source: The B<join-dctrl> program and this manual page were written by Antti-Juhani Kaijanaho.
de: Das Programm B<join-dctrl> und diese Handbuchseite wurden von Antti-Juhani Kaijanaho geschrieben.
fr: Le programme B<join-dctrl> et cette page de manuel ont été écrits par Antti-Juhani Kaijanaho.

source: sort-dctrl - sort Debian control files
de: sort-dctrl - sortiert Debian-Steuerdateien
fr: sort-dctrl - Ordonner des fichiers de contrôle Debian

source: B<sort-dctrl> [options] [ I<file> ... ]
de: B<sort-dctrl> [Optionen] [ I<Datei> … ]
fr: B<sort-dctrl> [I<options>] [ I<fichier> ... ]

source: The B<sort-dctrl> program sorts Debian control files according to specified criteria.
de: Das Programm B<sort-dctrl> sortiert Debian-Steuerdateien gemäß den angegebenen Kriterien.
fr: Le programme B<sort-dctrl> ordonne des fichiers de contrôle Debian suivant les critères indiqués.

source: The B<sort-dctrl> program recognizes two field types: string fields and version fields. Version fields act also as numeric fields. String fields are compared according to strict lexicographical octet-by-octet comparison, after ignoring any initial whitespace after the colon. Version fields are parsed and compared as Debian version numbers. When comparing version numbers, if a field content does not in fact conform to the version number syntax, it compares less than any field content that does conform, and equal to any other nonconforming field content. The B<sort-dctrl> program assumes all fields are string fields unless told otherwise.
de: Das Programm B<sort-dctrl> kennt zwei Feldtypen: Zeichenkettenfelder und Versionsfelder. Versionsfelder dienen außerdem als numerische Felder. Zeichenkettenfelder werden gemäß streng lexikografischem Vergleich Oktett für Oktett verglichen. Nach dem Doppelpunkt werden alle Leerzeichen am Anfang ignoriert. Versionsfelder werden als Debian-Versionsnummern ausgewertet und verglichen. Wenn Versionsnummern verglichen werden und ein Feldinhalt tatsächlich nicht zur Versionsnummersyntax passt, werden sie als weniger als irgendwelche passenden Felder betrachtet und gleich irgendwelchem anderen nicht passenden Feldinhalt. Das Programm The B<sort-dctrl> geht, wenn nichts anderes gesagt wurde, davon aus, dass alle Felder Zeichenkettenfelder sind.
fr: Le programme B<sort-dctrl> reconnaît deux types de champs : les champs de chaîne de caractères et les champs de version. Les champs de version agissent aussi comme des champs numériques. Les champs de chaîne de caractères sont comparés d'après une stricte comparaison octet par octet, après avoir ignoré tous les espaces initiaux suivant le deux-points. Les champs de version sont parcourus et comparés comme des numéros de version Debian. Lors de la comparaison de numéros de version, si un contenu de champ s'avère non conforme à la syntaxe de numéro de version, il est considéré plus petit que n'importe quel contenu conforme, et égal à tout autre contenu non conforme. Le programme B<sort-dctrl> suppose que tous les champs sont des champs de chaîne de caractères, sauf indication contraire.

source: You can specify arbitrary number of keys for sorting, using the B<-k> option. The keys are interpreted in a descending order of priority: the first key specified is primary, the second key specified is secondary, and so on. If two records compare equal under the primary key, then they are compared under the secondary key, and so on. If no keys are specified, a default key is assumed (the "Package" field with no modifiers).
de: Sie können mit der Option B<-k> eine beliebige Anzahl Schlüssel zur Sortierung angeben. Die Schlüssel werden mit einem abnehmenden Grad der Priorität interpretiert: Der erste angegebene Schlüssel ist primär, der zweite sekundär und so weiter. Falls zwei Datensätze unter ihrem Primärschlüssel gleich sind, werden sie unter ihrem Sekundärschlüssel verglichen und so weiter. Falls keine Schlüssel angegeben wurden, wird von einem Vorgabeschlüssel ausgegangen (dem Feld »Package« ohne Bestimmungswörter).
fr: Vous pouvez indiquer un nombre arbitraire de clefs pour le tri, en utilisant l'option B<-k>. Les clefs sont interprétées par ordre décroissant de priorité : la première clef indiquée est primaire, la deuxième clef indiquée est secondaire, etc. Si deux enregistrements sont égaux d'après la clef primaire, alors les clefs secondaires sont comparées, etc. Si aucune clef n'est indiquée, le champ « Package » sans modificateur est considéré comme clef par défaut.

source: B<-k >I<keyspec>, B<--key-spec=>I<keyspec>
de: B<-k >I<Schlüsselangabe>, B<--key-spec=>I<Schlüsselangabe>
fr: B<-k >I<clef>, B<--key-spec=>I<clef>

source: Specify one or more keys for sorting. You may specify this option any number of times. The I<keyspec> argument consists of a comma-separated list of key specifications. Each key specification consists of the name of the field that serves as the key, optionally followed by a colon and key modifiers. The following key modifiers are supported:
de: gibt einen oder mehrere Schlüssel für die Sortierung an. Sie können diese Option beliebig oft angeben. Das Argument I<Schlüsselangabe> besteht aus einer durch Komma getrennten Liste von Schlüsselangaben. Jede Schlüsselangabe besteht aus dem Namen des Feldes, das als Schlüssel dient, wahlweise gefolgt von einem Doppelpunkt und Schlüsselbestimmungswörtern. Die folgenden Schlüsselbestimmungswörter werden unterstützt:
fr: Indiquer une ou plusieurs clefs pour le tri. Vous pouvez indiquer cette option autant de fois que nécessaire. L'argument I<clef> est une liste de clefs séparées par des virgules. Chaque clef indiquée est le nom du champ qui sert de clef, éventuellement suivi d'un deux-points et du modificateur. Les modificateurs de clef suivants sont pris en charge :

source: Invert the comparison for this key, reversing the sorting order.
de: stellt den Vergleich für diesen Schlüssel auf den Kopf und kehrt die Sortierreihenfolge um.
fr: Inverser la comparaison pour cette clef, en inversant l'ordre de tri.

source: Treat this field as a version number field.
de: betrachtet dieses Feld als Versionsnummerfeld.
fr: Considérer ce champ comme un champ de numéro de version.

source: Treat this field as numeric, which currently is synonymous with B<v>.
de: betrachtet dieses Feld als numerisch, was derzeit gleichbedeutend mit B<v> ist.
fr: Considérer ce champ comme un nombre, ce qui est pour l'instant synonyme de B<v>.

source: Here are some sample invocations of the program:
de: Hier folgen einige Beispielaufrufe des Programms:
fr: Voici quelques exemples d'appel du programme.

source: Output the B<dpkg> I<available> file sorted by the package name.
de: gibt die B<dpkg>-Datei I<available> nach Paketnamen sortiert aus.
fr: Affiche le fichier I<available> de B<dpkg> ordonné par nom de paquet.

source: Output the B<dpkg> I<available> file sorted in ascending order of version numbers.
de: gibt die B<dpkg>-Datei I<available> in aufsteigender Reihenfolge der Versionsnummern aus.
fr: Affiche le fichier I<available> de B<dpkg> dans l'ordre croissant des numéros de version.

source: Output the B<dpkg> I<available> file sorted in descending order of version numbers.
de: gibt die B<dpkg>-Datei I<available> in absteigender Reihenfolge der Versionsnummern aus.
fr: Affiche le fichier I<available> de B<dpkg> dans l'ordre décroissant des numéros de version.

source: Output the B<dpkg> I<available> file sorted primarily in ascending order of package names and secondarily in descending order of version numbers.
de: gibt die B<dpkg>-Datei I<available> zuerst nach aufsteigender Reihenfolge der Paketnamen und dann nach absteigender Reihenfolge der Versionsnummern sortiert aus.
fr: Affiche le fichier I<available> de B<dpkg> ordonné en priorité par nom de paquet puis dans l'ordre décroissant des numéros de version.

source: Output the B<dpkg> I<available> file sorted primarily in ascending order of installation sizes and secondarily in descending order of package sizes.
de: gibt die B<dpkg>-Datei I<available> zuerst nach aufsteigender Reihenfolge der Installationsgrößen und dann nach absteigender Reihenfolge der Paketgrößen sortiert aus.
fr: Affiche le fichier I<available> de B<dpkg> ordonné en priorité dans l'ordre croissant des tailles d'installation puis dans l'ordre décroissant des tailles de paquet.

source: The program and this manual page were written by Antti-Juhani Kaijanaho E<lt>ajk@debian.orgE<gt>.
de: Das Programm und diese Handbuchseite wurden von Antti-Juhani Kaijanaho E<lt>I<gaia@iki.fi>E<gt> geschrieben.
fr: Le programme et cette page de manuel ont été écrits par Antti-Juhani Kaijanaho E<lt>ajk@debian.orgE<gt>.

source: Debian administrator's manual
de: Handbuch für Debian-Administratoren
fr: Manuel de l'administrateur Debian

source: sync-available - sync dpkg's available database with apt's database
de: sync-available - synchonisiert die dpkg-Datenbank »available« mit der Datenbank von APT
fr: sync-available - Synchroniser la base de données available de dpkg avec celle d'apt

source: This program updates the B<dpkg>(8) I<available> database with the data in the B<apt>(8) package database. This is required for B<grep-available>(1) and other similar programs to give up-to-date results.
de: Dieses Programm aktualisiert die B<dpkg>(8)-Datenbank I<available> mit den Daten der Paket-Datenbank von B<apt>(8). Dies ist nötig, damit B<grep-available>(1) und weitere ähnliche Programme aktuelle Ergebnisse liefern.
fr: Ce programme met à jour la base de données I<available> de B<dpkg>(8) à partir de la base de données de paquets d'B<apt>(8). C'est nécessaire à B<grep-available>(1) et d'autres programmes similaires pour fournir des résultats à jour.

source: The same functionality is available through B<dselect>(8), when it is configured to use B<apt>(8) as its acquisition method. However, this program does not require that B<dselect>(8) is installed.
de: Die gleiche Funktionalität ist durch B<dselect>(8) verfügbar, wenn es so konfiguriert ist, dass es B<apt>(8) als Erfassungsmethode benutzt. Dieses Programm erfordert allerdings nicht, dass B<dselect>(8) installiert ist.
fr: La même fonctionnalité est disponible avec B<dselect>(8) quand il est configuré pour utiliser B<apt>(8) comme méthode d'acquisition. Cependant, ce programme ne dépend pas de B<dselect>(8).

source: The program exits with status code B<0> if all went well, and a non-zero status code otherwise.
de: Das Programm wird mit dem Rückgabewert B<0> beendet, wenn alles gut funktionierte und ansonsten mit einem Rückgabewert ungleich Null.
fr: Le programme renvoie le code de retour B<0> lorsque tout s'est bien passé et une valeur non nulle dans le cas contraire.

source: Output the name and version of the program onto standard output stream.
de: gibt den Namen und die Version des Programms auf dem Standardausgabe-Datenstrom aus.
fr: Afficher le nom et la version du programme sur la sortie standard.

source: Give a brief usage statement on the standard output stream.
de: gibt eine kurze Aufrufanweisung auf dem Standardausgabe-Datenstrom aus.
fr: Afficher une brève notice d'utilisation sur la sortie standard.

source: ENVIRONMENT
de: UMGEBUNGSVARIABLEN
fr: ENVIRONNEMENT

source: The name of the directory where temporary files are created. Default is I</tmp>.
de: der Name des Verzeichnisses, in dem temporäre Dateien erstellt werden. Vorgabe ist I</tmp>.
fr: Le nom du répertoire où les fichiers temporaires sont créés, I</tmp> par défaut.

source: B<apt>(8), B<dpkg>(8), B<dselect>(8), B<grep-available>(1)
de: B<grep-available>(1), B<apt>(8), B<dpkg>(8), B<dselect>(8)

source: tbl-dctrl - generate tabular representations of data in dctrl format
de: tbl-dctrl - erzeugt tabellarische Darstellungen von Daten im Dctrl-Format
fr: tbl-dctrl - Créer des tableaux de données exprimées au format dctrl

source: B<tbl-dctrl> [ I<options> ] [ B<-c> I<column-specification> ... ] [ I<filename> ] ...
de: B<tbl-dctrl> [ I<Optionen> ] [ B<-c> I<Spaltenangabe> … ] [ I<Dateiname> ] …
fr: B<tbl-dctrl> [ I<options> ] [ B<-c> I<colonne> ... ] [ I<fichier> ] ...

source: B<tbl-dctrl> creates tabular representations of data given to it in Debian control file format.
de: B<tbl-dctrl> erzeugt tabellarische Darstellungen von Daten, die ihm im Format von Debian-Steuerdateien übergeben werden.
fr: B<tbl-dctrl> crée des tableaux à partir de données exprimées au format de fichiers de contrôle Debian.

source: By default, B<tbl-dctrl> reads the whole database, looking for the longest entry in each requested column; it then outputs a table, with borders and column titles, where each column is just wide enough to fit the longest entry.
de: Standardmäßig liest B<tbl-dctrl> die ganze Datenbank, sucht den längsten Eintrag in jeder angeforderten Spalte und gibt dann eine Tabelle mit Rändern und Spaltentiteln aus, wobei jede Spalte nur so breit wie der längste Eintrag ist.
fr: Par défaut, B<tbl-dctrl> lit l'ensemble de la base de données, à la recherche de la plus longue entrée de chaque colonne indiquée. Il affiche ensuite le tableau, avec des cadres et des titres de colonne, où chaque colonne est juste assez large pour afficher la plus longue entrée.

source: Most of this behaviour can be customized as described below.
de: Die meisten dieser Verhaltensweisen können, wie im Folgenden beschrieben, geändert werden.
fr: Ce comportement peut être personnalisé conformément aux descriptions suivantes.

source: A column is requested by specifying the B<-c> (B<--column>) switch with a column specification.
de: Eine Spalte wird durch Angabe des Schalters B<-c> (B<--column>) mit einer Spaltenangabe abgefragt.
fr: Une colonne est demandée en indiquant l'option B<-c> (B<--column>) suivie d'une spécification de colonne.

source: The simplest kind of a column specification consists solely of the name of a field.
de: Die einfachste Art einer Spaltenangabe besteht einzig aus dem Namen eines Feldes.
fr: Le nom d'un champ est la spécification de colonne la plus simple.

source: In such a case, B<tbl-dctrl> will include in the output a column whose title is the literal column specification and whose data is drawn from fields with that name.
de: In einem solchen Fall wird B<tbl-dctrl> in die Ausgabe eine Spalte einfügen, deren Titel die wörtliche Spaltenangabe ist und deren Daten aus den Feldern mit diesem Namen bezogen werden.
fr: Dans ce cas, B<tbl-dctrl> inclura dans la sortie une colonne dont le titre est le nom de colonne indiqué et dont les données sont tirées des champs de ce nom.

source: If no B<-c> options are given, B<tbl-dctrl> will use all fields in the input in the order in which they first appear.
de: Falls keine B<-c>-Optionen angegeben sind, wird B<tbl-dctrl> alle Felder in der Eingabe in der Reihenfolge verwenden, in der sie zuerst erscheinen.
fr: En absence d'option B<-c>, B<tbl-dctrl> utilisera tous les champs en entrée dans l'ordre où ils sont apparus pour la première fois.

source: There are two optional additions one can make to a column specification.
de: Es gibt zwei optionale Zusätze für eine Spaltenangabe.
fr: Deux ajouts facultatifs peuvent être faits à une spécification de colonne.

source: Prefixing the field name with some text followed by an equality sign (for example, B<-c 'Package name=Package'>) modifies the column in such a way that the text before the equality sign is used as the column title, while the text after the equality sign is used as the name of the field from which data is drawn.
de: Das Voranstellen von Text, gefolgt von einem Gleichzeichen vor den Feldnamen (zum Beispiel B<-c 'Paketname=Paket'>) ändert die Spalte so dass der Text vor den Gleichzeichen als Spaltentitel benutzt wird, während der Text dahinter als Name des Feldes genommen wird, aus dem die Daten bezogen werden.
fr: Précéder le nom de champ avec du texte suivi d'un signe égal (par exemple B<-c 'Nom de paquet=Package'>) modifie la colonne pour que le texte précédant le signe égal soit utilisé en titre de colonne, alors que le texte qui le suit est utilisé comme nom de champ à partir duquel les données sont tirées.

source: One can also append a colon followed by a positive whole number to the field name. In such a case, the number after the colon specifies the width of the column.
de: Es kann auch ein Doppelpunkt gefolgt von einer positiven Ganzzahl an den Feldnamen angehängt werden. In einem solchen Fall gibt die Zahl hinter dem Doppelpunkt die Spaltenbreite an.
fr: Un deux-points suivi d'un entier positif peut être ajouté au nom de champ. Dans ce cas, le nombre qui suit le deux-points indique la largeur de la colonne.

source: These two additions can be used separately or together.
de: Diese beiden Zusätze können getrennt oder zusammen benutzt werden.
fr: Ces deux ajouts peuvent être utilisés séparément ou ensemble.

source: If there are more than one colon, the last one is significant.
de: Falls dort mehr als ein Doppelpunkt ist, ist der letzte maßgeblich.
fr: S'il y a plus d'un deux-point, seul le dernier est pris en compte.

source: If there are more than one equals sign, the first one is significant.
de: Falls dort mehr als ein Gleichzeichen ist, ist das erste maßgeblich.
fr: S'il y a plus d'un signe égal, seul le premier est pris en compte.

source: Other colons and equals signs are used simply as data.
de: Andere Doppelpunkte und Gleichzeichen werden einfach als Daten verwandt.
fr: Les autres deux-points et signes égal sont simplement utilisés comme des données.

source: Note that the whole column specification must be given to B<tbl-dctrl> as one argument, so if it contains spaces, it must be quoted for the shell.
de: Beachten Sie, dass die ganze Spaltenangabe als ein Argument an B<tbl-dctrl> übergeben werden muss, da sie, falls sie Leerzeichen enthält, für die Shell maskiert werden muss.
fr: Remarquez que la totalité de la spécification de colonne doit être donnée à B<tbl-dctrl> comme un argument, donc si elle contient des espaces, il faut les protéger pour l'interpréteur.
