Repository: ajkaijanaho/dctrl-tools
Catalog: man/po4a/po/*.po
Languages: de, fr

source: Debian Project
de: Debian-Projekt
fr: Projet Debian

source: Debian user's manual
de: Debian-Benutzerhandbuch
fr: Manuel de l'utilisateur Debian

source: NAME
de: BEZEICHNUNG
fr: NOM

source: grep-dctrl, grep-status, grep-available, grep-aptavail, grep-debtags - grep Debian control files
de: grep-dctrl, grep-status, grep-available, grep-aptavail, grep-debtags - grep Debian-Steuerdateien
fr: grep-dctrl, grep-status, grep-available, grep-aptavail, grep-debtags - Rechercher dans des fichiers de contrôle Debian

source: SYNOPSIS
de: ÜBERSICHT

source: I<command> B<--copying>|B<-C> | B<--help>|B<-h> | B<--version>|B<-V>
de: I<Befehl> B<--copying>|B<-C> | B<--help>|B<-h> | B<--version>|B<-V>
fr: I<commande> B<--copying>|B<-C> | B<--help>|B<-h> | B<--version>|B<-V>

source: I<command> [I<options>] I<filter> [ I<file>... ]
de: I<Befehl> [I<Optionen>] I<Filter> [ I<Datei> …]
fr: I<commande> [I<options>] I<filtre> [ I<fichier>... ]

source: where I<command> is one of B<grep-dctrl>, B<grep-status>, B<grep-available>, B<grep-aptavail> and B<grep-debtags>.
de: wobei I<Befehl> entweder B<grep-dctrl>, B<grep-status>, B<grep-available>, B<grep-aptavail> oder B<grep-debtags> ist.
fr: où I<commande> est B<grep-dctrl>, B<grep-status>, B<grep-available>, B<grep-aptavail> ou B<grep-debtags>.

source: DESCRIPTION
de: BESCHREIBUNG

source: The B<grep-dctrl> program can answer such questions as I<What is the Debian package foo?>, I<Which version of the Debian package bar is now current?>, I<Which Debian packages does John Doe maintain?>, I<Which Debian packages are somehow related to the Scheme> I<programming language?>, and with some help, I<Who maintain the essential packages of a Debian system?>, given a useful input file.
de: Das Programm B<grep-dctrl> kann Fragen beantworten wie I<Was ist das Debian-Paket Foo?>, I<Welche Version des Pakets Bar ist nun aktuell?>, I<Welche Pakete betreut Max Mustermann?>, I<Welche Pakete gehören irgendwie zur Programmiersprache Scheme?> und mit etwas Hilfe I<Wer betreut die erforderlichen Pakete eines Debian-Systems?>, wenn eine nützliche Eingabedatei gegeben ist.
fr: Le programme B<grep-dctrl> peut répondre à des questions comme « I<Qu'est-ce que le paquet Debian bidule ?> », « I<Quelle est la dernière version du paquet Debian machin ?> », « I<Quels sont les paquets Debian maintenus par Anne Onyme ?> », « I<Quels sont les paquets Debian ayant un quelconque rapport avec le language de programmation Scheme ?> » et, avec un peu d'aide, « I<Qui sont les responsables des paquets essentiels d'un système Debian ?> » à partir d'un fichier utile donné.

source: The programs B<grep-available>, B<grep-status>, B<grep-aptavail> and B<grep-debtags> are aliases of (actually, symbolic links to) B<grep-dctrl>. In the shipped configuration, these aliases use as their default input the B<dpkg>(1) I<available> and I<status> files, the B<apt-cache dumpavail> output and the B<debtags dumpavail> output, respectively.
de: Die Programme B<grep-available>, B<grep-status>, B<grep-aptavail> und B<grep-debtags> sind Aliase für (tatsächlich symbolische Verweise auf) B<grep-dctrl>. In der mitgelieferten Konfiguration benutzen diese Aliase als ihre Standardeingabe die Dateien I<available> und I<status> von B<dpkg>(1), beziehungsweise die Ausgabe von B<apt-cache dumpavail> und B<debtags dumpavail>.
fr: Les programmes B<grep-available>, B<grep-status>, B<grep-aptavail> et B<grep-debtags> sont des alias de (en réalité, des liens symboliques vers) B<grep-dctrl>. Dans la configuration par défaut, ces alias utilisent en entrée respectivement les fichiers I<available> et I<status> de B<dpkg>(1), la sortie de B<apt-cache dumpavail>, et celle de B<debtags dumpavail>.

source: B<grep-dctrl> is a specialised B<grep> program that is meant for processing any file which has the general format of a Debian package I<control> file, as described in the Debian Policy. These include the B<dpkg> I<available> file, the B<dpkg> I<status> file, and the I<Packages> files on a distribution medium (such as a Debian CD-ROM or an FTP site carrying Debian).
de: B<grep-dctrl> ist ein spezialisiertes B<grep>-Programm, das für die Verarbeitung jeder Datei gedacht ist, die das Format einer I<Steuer>datei von Debian-Paketen hat, wie es von der Debian-Richtlinie beschrieben wird. Dies beinhaltet die I<status>-Datei von B<dpkg> und die I<Packages>-Dateien auf einem Weitergabe-Medium (wie einer Debian-CD-ROM oder einer FTP-Site, die Debian bereitstellt).
fr: B<grep-dctrl> est un programme à la B<grep> spécifique pour traiter n'importe quel fichier au format des fichiers I<control> de paquet Debian, décrit dans la Charte Debian. Cela comprend les fichiers I<available> et I<status> de B<dpkg>, et les fichiers I<Packages> d'un support de distribution (comme un CD Debian ou un site FTP de dépôt Debian).

source: You must give a I<filter> expression on the command line. The I<filter> defines which kind of paragraphs (aka package records) are output. A simple I<filter> is a search pattern along with any options that modify it. Possible modifiers are B<--eregex>, B<--field>, B<--ignore-case>, B<--regex> and B<--exact-match>, along with their single-letter equivalents. By default, the search is a case-sensitive fixed substring match on each paragraph (in other words, package record) in the input. With suitable modifiers, this can be changed: the search can be case-insensitive and the pattern can be seen as an extended POSIX regular expression.
de: Sie müssen auf der Befehlszeile einen I<Filter> angeben. Der I<Filter> definiert, welche Art von Absätzen (auch bekannt als Paket-Datensätze) ausgegeben werden. Ein einfacher I<Filter> ist ein Suchmuster zusammen mit einigen Optionen, die es ändern. Mögliche Bestimmungswörter sind B<--eregex>, B<--field>, B<--ignore-case>, B<--regex> und B<--exact-match> beziehungsweise ihre Gegenstücke aus einem einzelnen Buchstaben. Die Suche ist standardmäßig ein Vergleich fester Teilzeichenketten unter Berücksichtigung der Groß-/Kleinschreibung mit jedem Absatz (in anderen Worten, Paket-Datensatz) in der Eingabe. Mit geeigneten Bestimmungswörtern kann dies geändert werden: Die Suche kann unabhängig von der Groß-/Kleinschreibung sein und das Muster kann als erweiterter regulärer POSIX-Ausdruck betrachtet werden.
fr: Il faut donner une expression de I<filtre> sur la ligne de commande. Le I<filtre> définit le type de paragraphe (c'est à dire les enregistrements de paquet) qui seront affichés. Un I<filtre> élémentaire est un motif de recherche accompagné d'options pour le modifier. Les modificateurs possibles sont B<--eregex>, B<--field>, B<--ignore-case>, B<--regex> et B<--exact-match>, ainsi que les options courtes équivalentes. Par défaut, une portion figée de chaîne de caractères qui respecte la casse est recherchée dans chaque paragraphe (autrement dit, chaque enregistrement de paquet) de l'entrée. Avec les modificateurs adéquats, ce comportement peut être modifié : la recherche peut être indépendante de la casse et le motif peut être considéré comme une expression rationnelle étendue POSIX.

source: I<Filter>s can be combined to form more complex I<filter>s using the connectives B<--and>, B<--or> and B<--not>. Parentheses (which usually need to be escaped for the shell) can be used for grouping.
de: I<Filter> können mit den Bindewörtern B<--and>, B<--or> und B<--not> zu komplexeren I<Filter>n kombiniert werden. Klammern (die normalerweise für die Shell maskiert werden müssen) können zur Gruppierung benutzt werden.
fr: Les I<filtre>s peuvent être combinés en I<filtre>s plus compliqués avec les opérateurs B<--and>, B<--or> et B<--not>. Les parenthèses (qui doivent normalement être protégées pour l'interpréteur de commandes) peuvent servir à grouper les filtres.

source: By default, the full matching paragraphs are printed on the standard output; specific fields can be selected for output with the B<-s> option.
de: Standardmäßig werden die vollständig passenden Absätze auf der Standardausgabe ausgegeben; spezielle Felder können mit der Option B<-s> für die Ausgabe ausgewählt werden.
fr: Par défaut, les paragraphes correspondants sont affichés en entier sur la sortie standard. Des champs particuliers peuvent être choisis pour l'affichage avec l'option B<-s>.

source: After the I<filter> expression comes zero or more I<file> names. If no I<file> names are specified, the I<file> name is searched in configuration files. The input I<file> in association with the correct program name is used. The program names are matched with the base form of the name of the current program (the 0'th command line argument, if you will). The I<file> name B<-> is taken to mean the standard input stream. The I<file>s are searched in order but separately; they are B<not> concatenated together. In other words, the end of a I<file> always implies the end of the current paragraph.
de: Nach dem I<Filter>ausdruck kommen keine oder mehr I<Datei>namen. Falls keine I<Datei>namen angegeben werden, wird der I<Datei>name in Konfigurationsdateien gesucht. Es wird die EingabeI<datei> in Verbindung mit dem korrekten Programmnamen benutzt. Die Programmnamen werden mit der Basisform des Namens des aktuellen Programms verglichen (das nullte Befehlszeilenargument, wenn Sie so wollen). Der I<Datei>name B<-> wird als Synonym für den Standardeingabe-Datenstrom benutzt. Die I<Datei>en werden nacheinander, aber einzeln durchsucht; sie werden I<nicht> zusammengehängt. In anderen Worten, impliziert das Ende einer I<Datei> immer das Ende des aktuellen Absatzes.
fr: L'expression I<filtre> est suivie de zéro ou plusieurs noms de I<fichier>. Si aucun nom de I<fichier> n'est précisé, le nom de I<fichier> est recherché dans les fichiers de configuration. Le I<fichier> d'entrée associé au nom de programme valable est utilisé. Les noms de programme correspondent à la forme du nom de programme actuel (l'argument zéro de la ligne de commande si vous préférez). Le nom de I<fichier> B<-> est utilisé pour désigner le flux d'entrée standard. Les I<fichier>s sont parcourus dans l'ordre, mais un par un : il ne sont B<pas> concaténés. Autrement dit, la fin d'un I<fichier> indique toujours la fin d'un paragraphe.

source: There is one exception to the above: if the program name is B<grep-dctrl>, the default input source is always standard input; this cannot be overridden by the configuration file.
de: Es gibt eine Ausnahme von Obigem: Falls der Programmname B<grep-dctrl> ist, ist die vorgegebenen Eingabequelle immer die Standardeingabe; dies kann nicht durch die Konfigurationsdatei außer Kraft gesetzt werden.
fr: Il existe une exception à ce qui précède : si le nom de programme est B<grep-dctrl>, la source d'entrée par défaut est toujours l'entrée standard. Il n'est pas possible de modifier ce comportement dans le fichier de configuration.

source: OPTIONS
de: OPTIONEN

source: Specifying the search pattern
de: Angabe des Suchmusters
fr: Indication du motif de recherche

source: B<--pattern=>I<pattern>
de: B<--pattern=>I<Muster>
fr: B<--pattern=>I<motif>

source: Specify a I<pattern> to be searched. This switch is not generally needed, as the I<pattern> can be given by itself. However, I<pattern>s that start with a dash (B<->) must be given using this switch, so that they wouldn't be mistaken for switches.
de: gibt das I<Muster> an, nach dem gesucht wird. Dieser Schalter wird im Allgemeinen nicht benötigt, da das I<Muster> selbst angegeben werden kann. I<Muster>, die mit einem Bindestrich (B<->) beginnen, müssen diesen Schalter jedoch benutzen, da sie sonst irrtümlich für Schalter gehalten würden.
fr: Indiquer un I<motif> à rechercher. Cette option n'est généralement pas nécessaire, car le I<motif> peut être donné directement. Cependant, les I<motif>s qui commencent par un tiret (B<->) doivent être donnés en utilisant cette option, pour ne pas être confondus avec des options.

source: Modifiers of simple filters
de: Bestimmungswörter von einfachen Filtern
fr: Modificateurs de filtres élémentaires

source: B<-F >I<field>,I<field>, ... | B<--field=>I<field>,I<field>, ...
de: B<-F >I<Feld>,I<Feld>, … | B<--field=>I<Feld>,I<Feld>, …
fr: B<-F >I<champ>,I<champ>, ... | B<--field=>I<champ>,I<champ>, ...

source: Restrict pattern matching to the I<field>s given. Multiple I<field> names in one B<-F> option and multiple B<-F> options in one simple I<filter> are allowed. The search named by the filter will be performed among all the I<field>s named, and as soon as any one of them matches, the whole simple I<filter> is considered matching.
de: beschränkt den Mustervergleich auf die angegebenen I<Feld>er. Mehrere I<Feld>namen in einer B<-F>-Option oder mehrere B<-F>-Optionen in einem einfachen Filter sind erlaubt. Die durch den Filter benannte Suche wird inmitten all der genannten I<Feld>er durchgeführt und sobald eines von ihnen passt, wird der ganze einfache I<Filter> als passend angesehen.
fr: Réduire le motif correspondant aux I<champ>s donnés. Plusieurs noms de I<champ> dans une option B<-F> et plusieurs options B<-F> dans un seul I<filtre> sont permis. La recherche désignée par le filtre sera réalisée parmi tous les I<champ>s désignés, et dès que l'un d'entre eux correspond, l'intégralité du I<filtre> élémentaire sera considéré comme correspondant.

source: A I<field> specification can contain a colon (B<:>). In such a case, the part up to the colon is taken as the name of the field to be searched in, and the part after the colon is taken as the name of the field whose content is to be used if the field to search in is empty.
de: Eine I<Feld>angabe kann einen Doppelpunkt (B<:>) enthalten. In einem solchen Fall wird der Teil bis zum Doppelpunkt als Name des Feldes genommen, das angezeigt wird, und der Teil nach dem Doppelpunkt als Name des Feldes, dessen Inhalt benutzt wird, falls das Feld leer ist, das angezeigt werden soll.
fr: Une spécification de I<champ> peut contenir un deux-points (B<:>). Dans ce cas, la partie précédant le deux-points est considérée comme le nom du champ dans lequel il faut chercher, et la partie après le deux-points est considérée comme le nom du champ dont le contenu sera utilisé si le champ à chercher est vide.

source: Shorthand for B<-FPackage>.
de: Kürzel für B<-FPackage>
fr: Raccourci pour B<-FPackage>.

source: Shorthand for B<-FSource:Package>.
de: Kürzel für B<-FSource:Package>
fr: Raccourci pour B<-FSource:Package>.

source: Regard the pattern of the current simple filter as an extended POSIX regular expression
de: betrachtet das Muster des aktuellen einfachen Filters als einen erweiterten regulären POSIX-Ausdruck.
fr: Considérer le motif du filtre élémentaire actuel comme une expression rationnelle étendue POSIX.

source: Regard the pattern of the current simple filter as a standard POSIX regular expression.
de: betrachtet das Muster des aktuellen einfachen Filters als einen regulären Standard-POSIX-Ausdruck.
fr: Considérer le motif du filtre élémentaire actuel comme une expression rationnelle standard POSIX.

source: Ignore case when looking for a match in the current simple filter.
de: ignoriert bei der Suche nach einer Entsprechung zum aktuellen einfachen Filter die Groß-/Kleinschreibung.
fr: Ignorer la casse lors de la recherche d'une correspondance dans le filtre élémentaire actuel.

source: Do an exact match (as opposed to a substring match) in the current simple filter.
de: sucht eine exakte Entsprechung (im Gegensatz zur Entsprechung einer Teilzeichenkette) zum aktuellen einfachen Filter.
fr: Faire une correspondance exacte (contrairement à une correspondance de portion de chaîne) dans le filtre élémentaire actuel.

source: Do an extended regular expression match on whole package names, assuming the syntax of inter-package relationship fields such as B<Depends>,B<Recommends>, ... When this flag is given you should not worry about sub-package names such as "libpcre3" also matching "libpcre3-dev". This flag implies (and is incompatible with) B<-e>.
de: sucht eine Entsprechung eines erweiterten regulären Ausdrucks zum vollständigen Paketnamen und schätzt die Syntax für Beziehungsfelder zwischen Paketen, wie B<Depends>, B<Recommends>, … Wenn dieser Schalter angegeben ist, sollten Sie sich keine Gedanken darüber machen, ob Unterpaketnamen wie »libpcre3« ebenfalls auf »libpcre3-dev« passen. Dieser Schalter impliziert (und ist inkompatibel mit) B<-e>.
fr: Faire correspondre une expression rationnelle étendue sur l'ensemble des noms de paquet, en supposant que la syntaxe des champs reliant les paquets est comme B<Depends>, B<Recommends>, etc. Quand cette option est donnée, ce n'est pas la peine de se préoccuper des noms de sous-paquets comme par exemple « libpcre3 » qui correspond aussi à « libpcre3-dev ». Cette option implique (et est incompatible avec) B<-e>.

source: Do an equality comparison under the Debian version number system. If the pattern or the field to be searched in is not a valid Debian version number, the paragraph is regarded as not matching. As a special case, this is capable of comparing simple nonnegative integers for equality.
de: vergleicht, ob unter dem Debian-Versionsnummernsystem Gleichheit besteht. Falls das Muster oder das zu durchsuchende Feld keine gültige Debian-Versionsnummer ist, wird der Absatz als nicht passend angesehen. Als Sonderfall ist dies imstande, einzelne, nicht negative Ganzzahlen auf Gleichheit zu prüfen.
fr: Faire un test d'égalité dans le système de numérotation de version Debian. Si le motif ou le champ dans lequel il faut chercher n'est pas un numéro de version Debian valable, le paragraphe est considéré comme non correspondant. En particulier, le test d'égalité entre simples entiers positifs est possible.

source: Do an strictly-less-than comparison under the Debian version number system. If the pattern or the field to be searched in is not a valid Debian version number, the paragraph is regarded as not matching. As a special case, this is capable of comparing simple nonnegative integers.
de: führt einen »strikt-weniger-als«-Vergleich unter dem Debian-Versionsnummernsystem durch. Falls das Muster oder das zu durchsuchende Feld keine gültige Debian-Versionsnummer ist, wird der Absatz als nicht passend angesehen. Als Sonderfall ist dies imstande, einzelne nicht negative Ganzzahlen auf Gleichheit zu prüfen.
fr: Faire une comparaison de stricte infériorité dans le système de numérotation de version Debian. Si le motif ou le champ dans lequel il faut chercher n'est pas un numéro de version Debian valable, le paragraphe est considéré comme non correspondant. En particulier, la comparaison de simples entiers positifs est possible.

source: Do an less-than-or-equal comparison under the Debian version number system. If the pattern or the field to be searched in is not a valid Debian version number, the paragraph is regarded as not matching. As a special case, this is capable of comparing simple nonnegative integers.
de: führt einen »weniger-oder-gleich«-Vergleich unter dem Debian-Versionsnummernsystem durch. Falls das Muster oder das zu durchsuchende Feld keine gültige Debian-Versionsnummer ist, wird der Absatz als nicht passend angesehen. Als Sonderfall ist dies imstande, einzelne nicht negative Ganzzahlen auf Gleichheit zu prüfen.
fr: Faire une comparaison d'infériorité ou d'égalité dans le système de numérotation de version Debian. Si le motif ou le champ dans lequel il faut chercher n'est pas un numéro de version Debian valable, le paragraphe est considéré comme non correspondant. En particulier, la comparaison de simples entiers positifs est possible.

source: Do an strictly-greater-than comparison under the Debian version number system. If the pattern or the field to be searched in is not a valid Debian version number, the paragraph is regarded as not matching. As a special case, this is capable of comparing simple nonnegative integers.
de: führt einen »strikt-größer-als«-Vergleich unter dem Debian-Versionsnummernsystem durch. Falls das Muster oder das zu durchsuchende Feld keine gültige Debian-Versionsnummer ist, wird der Absatz als nicht passend angesehen. Als Sonderfall ist dies imstande, einzelne nicht negative Ganzzahlen auf Gleichheit zu prüfen.
fr: Faire une comparaison de stricte supériorité dans le système de numérotation de version Debian. Si le motif ou le champ dans lequel il faut chercher n'est pas un numéro de version Debian valable, le paragraphe est considéré comme non correspondant. En particulier, la comparaison de simples entiers positifs est possible.

source: Do an greater-than-or-equal comparison under the Debian version number system. If the pattern or the field to be searched in is not a valid Debian version number, the paragraph is regarded as not matching. As a special case, this is capable of comparing simple nonnegative integers.
de: führt einen »größer-oder-gleich«-Vergleich unter dem Debian-Versionsnummernsystem durch. Falls das Muster oder das zu durchsuchende Feld keine gültige Debian-Versionsnummer ist, wird der Absatz als nicht passend angesehen. Als Sonderfall ist dies imstande, einzelne nicht negative Ganzzahlen auf Gleichheit zu prüfen.
fr: Faire une comparaison de supériorité ou d'égalité dans le système de numérotation de version Debian. Si le motif ou le champ dans lequel il faut chercher n'est pas un numéro de version Debian valable, le paragraphe est considéré comme non correspondant. En particulier, la comparaison de simples entiers positifs est possible.

source: Combining filters
de: Filter kombinieren
fr: Combinaison de filtres

source: Match if the following filter does B<not> match.
de: passt, falls der folgende Filter B<nicht> passt.
fr: Correspondre si le filtre suivant ne correspond B<pas>.

source: Match if either one or both of the preceding and following filters matches.
de: passt, wenn entweder der vorhergehende, der folgende oder beide Filter passen.
fr: Correspondre si l'un des deux filtres (précédent et suivant) correspond.

source: Match if both the preceding and the following filter match.
de: passt, wenn sowohl der vorhergehende als auch der folgende Filter passt.
fr: Correspondre si les deux filtres (précédent et suivant) correspondent.

source: Parentheses can be used for grouping. Note that they need to be escaped for most shells.
de: Klammern können zum Gruppieren benutzt werden. Beachten Sie, dass sie für die meisten Shells maskiert werden müssen.
fr: Les parenthèses peuvent être utilisées pour grouper. Remarquez qu'il faut les protéger dans la plupart des interpréteurs de commandes.

source: Output format modifiers
de: Ausgabeformat-Bestimmungswörter
fr: Modificateurs de format de sortie

source: B<-s >I<field>,I<field>, ... | B<--show-field=>I<field>,I<field>, ...
de: B<-s >I<Feld>,I<Feld>, … | B<--show-field=>I<Feld>,I<Feld>, …
fr: B<-s >I<champ>,I<champ>, ... | B<--show-field=>I<champ>,I<champ>, ...

source: Show only the body of these I<field>s from the matching paragraphs. The I<field> names must not include any colons or commas. Commas are used to delimit I<field> names in the argument to this option. The I<field>s are shown in the order given here. See also the option B<-I>.
de: zeigt nur den Rumpf dieser I<Feld>er von passenden Absätzen. Die I<Feld>namen dürfen keine Doppelpunkte oder Kommas enthalten. Kommas werden zum Begrenzen von I<Feld>namen im Argument dieser Option benutzt. Die I<Feld>er werden in der hier angegebenen Reihenfolge angezeigt. Siehe auch die Option B<-I>.
