Repository: ajkaijanaho/dctrl-tools
Catalog: man/po4a/po/*.po
Languages: de, fr

source: Invert the meaning of option B<-s>: show only the fields that have B<not> been named using a B<-s> option. As an artefact of the implementation, the order of the fields in the original paragraph is not preserved.
de: kehrt die Bedeutung der Option B<-s> um: zeigt nur die Felder, die B<nicht> unter Benutzung der Option B<-s> benannt wurden. Als ein Artefakt der Implementierung wird die Reihenfolge der Felder in den Originalabsätzen nicht aufbewahrt.
fr: Inverser le sens de l'option B<-s> : montrer seulement les champs qui n'ont B<pas> été nommés en utilisant l'option B<-s>. À cause de l'implémentation, l'ordre des champs du paragraphe d'origine n'est pas conservé.

source: A I<field> specification can contain a colon. In such a case, the part up to the colon is taken as the name of the field to be shown, and the part after the colon is taken as the name of the field whose content is to be used if the field to be shown is empty.
de: Eine I<Feld>angabe kann einen Doppelpunkt enthalten. In einem solchen Fall wird der Teil bis zum Doppelpunkt als Name des Feldes genommen, das angezeigt wird, und der Teil nach dem Doppelpunkt als Name des Feldes, dessen Inhalt benutzt wird, falls das Feld, das angezeigt werden soll, leer ist.
fr: Une spécification de I<champ> peut contenir un deux-points. Dans ce cas, la partie qui précède le deux-points est considérée comme le nom du champ à montrer, et la partie qui suit le deux-points est considérée comme le nom du champ dont le contenu sera utilisé si le champ à montrer est vide.

source: Show only the first line of the B<Description> field from the matching paragraphs. If no B<-s> option is specified, this option also effects B<-s Description>; if there is a B<-s> option but it does not include the B<Description> field name, one is appended to the option. Thus the B<Description> field's location in the output is determined by the B<-s> option, if any, the last field being the default.
de: zeigt nur die erste Zeile des Feldes B<Beschreibung> der passenden Absätze. Falls keine B<-s>-Option angegeben ist, bewirkt diese Option außerdem B<-s Beschreibung>; falls es dort eine B<-s>-Option gibt, sie aber nicht den Feldnamen der B<Beschreibung> enthält, wird der Option einer angehängt. Daher wird die Lage des Feldes B<Beschreibung> in der Ausgabe durch die Option B<-s> bestimmt, falls eine angegeben ist. Vorgabe ist das letzte Feld.
fr: Montrer seulement la première ligne du champ B<Description> des paragraphes correspondants. Si l'option B<-s> n'est pas indiquée, B<-s Description> est implicitement ajouté ; si une option B<-s> est indiquée sans champ B<Description>, il est ajouté à l'option. Ainsi l'emplacement du champ B<Description> dépend de l'option B<-s>, c'est le dernier par défaut.

source: Suppress field names when showing specified fields, only their bodies are shown. Each field is printed in its original form without the field name, the colon after it and any whitespace preceding the start of the body.
de: unterdrückt Feldnamen, wenn die angegebenen Felder angezeigt werden, nur ihr Inhalt wird angezeigt. Jedes Feld wird in seiner Originalform ohne den Feldnamen, den Doppelpunkt dahinter und ohne irgendwelche Leerräume vor dem Anfang des Inhalts ausgegeben.
fr: Supprimer les noms de champ à l'affichage : seul les corps sont affichés. Chaque champ est affiché dans sa forme d'origine sans nom de champ ni les deux points ni les espaces qui précèdent le début du corps.

source: Instead of showing all the paragraphs that match, show those paragraphs that do B<not> match.
de: zeigt anstelle aller passende Absätze nur jene, die B<nicht> passen.
fr: Au lieu de montrer tous les paragraphes qui correspondent, afficher ceux qui ne correspondent B<pas>.

source: Instead of showing the paragraphs that match (or, with B<-v>, that don't match), show the count of those paragraphs.
de: zeigt anstelle aller passenden (oder mit B<-v> nicht passenden) Absätze nur ihre Anzahl.
fr: Au lieu de montrer tous les paragraphes qui correspondent (ou, avec B<-v>, ceux qui ne correspondent B<pas>), afficher le décompte de ces paragraphes.

source: Output nothing to the standard output stream. Instead, exit immediately after finding the first match.
de: gibt nichts auf dem Standardausgabe-Datenstrom aus; wird stattdessen sofort nach den ersten Treffer beendet
fr: Ne rien afficher sur le flux de sortie standard. À la place, quitter directement après avoir trouvé la première correspondance.

source: Miscellaneous
de: Verschiedenes
fr: Divers

source: Ignore errors in parsing input. A paragraph which cannot be parsed is ignored in its entirety, and the next paragraph is assumed to start after the first newline since the location of the error.
de: ignoriert Fehler beim Auswerten der Eingabe. Ein Absatz, der nicht ausgewertet werden kann, wird im Ganzen ignoriert und vom nächsten Absatz wird angenommen, dass er nach dem ersten Zeilenumbruch nach der fehlerhaften Stelle beginnt.
fr: Ignorer les erreurs dans l'analyse en entrée. Un paragraphe qui ne peut pas être analysé est intégralement ignoré. Le paragraphe suivant est supposé commencer après le premier changement de ligne qui suit l'erreur.

source: B<--config-file=>I<filename>
de: B<--config-file=>I<Dateiname>
fr: B<--config-file=>I<nomdefichier>

source: Use I<filename> as the config file instead of the defaults.
de: benutzt anstelle der Vorgabe I<Dateiname> als Konfigurationsdatei.
fr: Utiliser I<nomdefichier> comme fichier de configuration au lieu du fichier par défaut.

source: Show how the current command line has been parsed.
de: zeigt, wie die aktuelle Befehlszeile ausgewertet wurde.
fr: Afficher la façon dont la ligne de commande actuelle a été analysée.

source: B<-l >I<level>, B<--errorlevel=>I<level>
de: B<-l >I<Stufe>, B<--errorlevel=>I<Stufe>
fr: B<-l >I<niveau>, B<--errorlevel=>I<niveau>

source: Set log level to I<level>. I<level> is one of B<fatal>, B<important>, B<informational> and B<debug>, but the last may not be available, depending on the compile-time options. These categories are given here in order; every message that is emitted when B<fatal> is in effect, will be emitted in the B<important> error level, and so on. The default is B<important>.
de: setzt die Protokollierungsstufe auf I<Stufe>. I<Stufe> ist entweder B<fatal>, B<important>, B<informational> oder B<debug>, aber Letzteres ist, abhängig von den Optionen zur Kompilierzeit, möglicherweise nicht verfügbar. Diese Kategorien sind hier in ihrer Reihenfolge angegeben; jede Nachricht, die ausgegeben wird, während B<fatal> in Kraft ist, wird in der Fehlerstufe B<important> ausgegeben und so weiter. Vorgabe ist B<important>.
fr: Configurer le I<niveau> de journalisation, où I<niveau> est B<fatal>, B<important>, B<informational> ou B<debug>. La disponibilité de B<debug> depend des options de compilation. Ces catégories sont ici données dans l'ordre : tous les messages émis lorsque B<fatal> est choisi seront affichés pour un niveau d'erreur B<important>, etc. Par défaut, B<important> est sélectionné.

source: Print out version information.
de: gibt Versionsinformationen aus.
fr: Afficher les informations de version.

source: Print out the copyright license. This produces much output; be sure to redirect or pipe it somewhere (such as your favourite pager).
de: gibt die Copyright-Lizenz aus. Dies produziert eine große Ausgabe; stellen Sie sicher, dass Sie sie irgendwohin um- oder weiterleiten (wie etwa Ihren bevorzugten Dateibetrachter).
fr: Afficher la licence. La sortie est particulièrement longue, veuillez la rediriger quelque part, ou utiliser une conduite (vers votre afficheur de texte préféré par exemple).

source: Print out a help summary.
de: gibt eine Zusammenfassung von Hilfetexten aus.
fr: Afficher une courte aide.

source: EXAMPLES
de: BEISPIELE
fr: EXEMPLES

source: The following example queries assume that the default configuration is in effect.
de: Die folgenden Beispielanfragen gehen davon aus, dass die Standardkonfiguration in Kraft ist.
fr: Les exemples de requêtes suivants supposent que la configuration est celle par défaut.

source: The almost simplest use of this program is to print out the status or available record of a package. In this respect, B<grep-dctrl> is like B<dpkg -s> or B<dpkg --print-avail>. To print out the status record of the package "mixal", do
de: Die nahezu einfachste Benutzung dieses Programms ist die Ausgabe des Status oder der verfügbaren Datensätze eines Pakets. In dieser Hinsicht ist B<grep-dctrl> wie B<dpkg -s> oder B<dpkg --print-avail>. Um den Status-Datensatz des Pakets »mixal« anzuzeigen, geben Sie
fr: L'utilisation la plus simple de ce programme, ou presque, est d'afficher l'enregistrement d'état ou de disponibilité d'un paquet. À cet égard, B<grep-dctrl> ressemble à B<dpkg -s> ou B<dpkg --print-avail>. Pour afficher l'enregistrement d'état du paquet « mixal », faire

source: and to get its available record, use
de: ein und um seinen Verfügbarkeitsdatensatz zu erhalten, benutzen Sie
fr: et pour obtenir l'enregistrement de disponibilité, utiliser

source: In fact, you can ask for the record of the "mixal" package from any Debian control file. Say, you have the Debian 6.0 CD-ROM's I<Packages> file in the current directory; now you can do a
de: Eigentlich können Sie den Datensatz des Pakets »mixal« von jeder Debian-Steuerdatei abfragen. Angenommen, Sie haben die Datei I<Packages> von der Debian-6.0-CD-ROM im aktuellen Verzeichnis; nun können Sie Folgendes ausführen:
fr: iEn fait, vous pouvez demander l'enregistrement du paquet « mixal » dans n'importe quel fichier de contrôle Debian. Si par exemple vous possédez les fichiers I<Packages> des CD de Debian 6.0 dans le répertoire actuel, vous pouvez faire

source: But B<grep-dctrl> can do more than just emulate B<dpkg>. It can more-or-less emulate B<apt-cache>! That program has a search feature that searches package descriptions. But we can do that too:
de: Aber B<grep-dctrl> kann mehr als nur B<dpkg> nachzuahmen. Es kann mehr oder weniger B<apt-cache> nachbilden! Dieses Programm hat eine Suchfunktion, die Paketbeschreibungen durchsucht. Aber Sie können auch dies tun:
fr: Mais B<grep-dctrl> peut faire bien plus qu'émuler seulement B<dpkg>. Il peut plus ou moins émuler B<apt-cache> ! Ce programme contient une fonctionnalité de recherche dans les descriptions de paquets. Mais on peut aussi faire

source: searches for the string "foo" case-sensitively in the descriptions of all available packages. If you want case-insensitivity, use
de: sucht die Zeichenkette »foo« unter Berücksichtigung der Groß-/Kleinschreibung in allen verfügbaren Paketen. Falls Sie die Groß-/Kleinschreibung nicht berücksichtigen möchten, führen Sie Folgendes aus:
fr: qui recherche la chaîne « bidule » sensible à la casse dans les descriptions de tous les paquets disponibles. Pour une recherche insensible à la casse, utiliser

source: Truth to be told, B<apt-cache> searches package names, too. We can separately search in the names; to do so, do
de: Ehrlich gesagt, sucht B<apt-cache> auch Paketnamen. Es kann separat in den Namen suchen. Führen Sie Folgendes aus, um dies zu tun:
fr: À vrai dire, B<apt-cache> recherche aussi les noms de paquet. La recherche dans les noms peut être faite séparément, à l'aide de

source: % grep-available -F Package foo
de: % grep-available -F Paket foo
fr: % grep-available -F Package bidule

source: or
de: oder
fr: ou

source: which is pretty much the same thing. We can also search in both descriptions and names; if match is found in either, the package record is printed:
de: was so ungefähr das Gleiche ist. Es kann außerdem sowohl in Beschreibungen als auch in Namen gesucht werden; falls in einem von beiden etwas gefunden wird, wird der Paketdatendatz ausgegeben:
fr: ce qui revient à peu près au même. On peut aussi rechercher à la fois dans les descriptions et les noms. Si une correspondance est trouvée dans l'un des deux, l'enregistrement du paquet est affiché avec

source: This kind of search is the exactly same that B<apt-cache> does.
de: Diese Art der Suche entspricht exakt dem, was B<apt-cache> tut.
fr: Ce genre de recherche est identique à celle d'B<apt-cache>.

source: Here's one thing neither B<dpkg> nor B<apt-cache> do. Search for a string in the whole I<status> or I<available> file (or any Debian control file, for that matter) and print out all package records where we have a match. Try
de: Hier nun etwas, was weder B<dpkg> noch B<apt-cache> kann: Suche nach einer Zeichenkette in der ganzen I<status>- oder I<available>-Datei (oder auch irgendeiner Debian-Steuerdatei) und Ausgabe aller Paketdatensätze, bei denen es einen Treffer gibt. Versuchen Sie
fr: Voici quelque chose que ne font ni B<dpkg> ni B<apt-cache>. Rechercher une chaîne dans le fichier I<status> ou I<available> complet (ou n'importe quel fichier de contrôle Debian d'ailleurs) et afficher tous les enregistrements de paquet correspondants. Essayer

source: sometime and watch how thoroughly B<dpkg> has infiltrated Debian.
de: und beobachten Sie, wie gründlich B<dpkg> Debian unterwandert hat.
fr: de temps en temps pour observer à quel point B<dpkg> s'est infiltré en profondeurdans Debian.

source: All the above queries were based on simple substring searches. But B<grep-dctrl> can handle regular expressions in the search pattern. For example, to see the status records of all packages with either "apt" or "dpkg" in their names, use
de: Alle vorhergehenden Abfragen basieren auf der einfachen Suche nach Teilzeichenketten. Aber B<grep-dctrl> kann reguläre Ausdrücke in Suchmustern handhaben. Um zum Beispiel die Statusdatensätze alle Pakete zu sehen, die entweder »apt« oder »dpkg« in ihrem Namen haben, benutzen Sie
fr: Toutes les requêtes précédentes sont basées sur de simples recherches de sous-chaînes. Mais B<grep-dctrl> peut gérer des expressions rationnelles dans les motif de recherche. Par exemple, pour voir les enregistrement d'état de tous les paquets ayant soit « apt » soit « dpkg » dans leurs noms, utiliser

source: Now that we have seen all these fine and dandy queries, you might begin to wonder whether it is necessary to always see the whole paragraph. You may be, for example, interest only in the dependency information of the packages involved. Fine. To show the depends lines of all packages maintained by me, do a
de: Nun, nachdem all diese feinen und tollen Anfragen betrachtet wurden, sind Sie vielleicht gespannt, warum es nötig ist, immer den ganzen Absatz zu sehen. Sie interessieren sich möglicherweise nur für die Abhängigkeitsinformationen der beteiligten Pakete. Gut. Um die Abhängigkeitszeilen aller vom Verfasser betreuten Pakete anzuzeigen, geben Sie Folgendes ein:
fr: Après avoir vu toutes ces requêtes qui fonctionnent bien, vous devez vous demander s'il est nécessaire de toujours voir l'intégralité du paragraphe. Vous pourriez, par exemple, n'être intéressé que par les informations de dépendances des paquets concernés. Pour montrer les lignes de dépendances de tous les paquets que je maintiens, faire

source: If you want to see the packages' names, too, use
de: Falls Sie auch die Paketnamen sehen möchten, benutzen Sie
fr: Pour voir aussi les noms de paquet, utiliser

source: Note that there must be no spaces in the argument to the B<-s> switch.
de: Beachten Sie, dass im Argument für den Schalter B<-s> keine Leerzeichen sein dürfen.
fr: Remarquez qu'il ne peut pas y avoir d'espace dans l'argument de l'option B<-s>.

source: More complex queries are also possible. For example, to see the list of packages maintained by me and depending on libc6, do
de: Es sind auch komplexere Abfragen möglich. Um zum Beispiel die Liste der Pakete zu sehen, die vom Verfasser betreut werden und von libc6 abhängen, geben Sie Folgendes ein:
fr: On peut aussi faire des requêtes plus compliquées. Par exemple, pour voir la liste des paquets que je maintiens et qui dépendent de libc6, faire

source: Remember that you can use other UNIX filters to help you, too. Ever wondered, who's the most active Debian developer based on the number of source packages being maintained? Easy. You just need to have a copy of the most recent I<Sources> file from any Debian mirror.
de: Vergessen Sie nicht, dass Sie auch andere UNIX-Filter benutzen können. Haben Sie sich schon einmal gefragt, wer der aktivste Debian-Entwickler auf Basis der betreuten Pakete ist? Das ist einfach. Sie benötigen nur eine Kopie der aktuellsten I<Sources>-Datei von irgendeinem Debian-Spiegelserver.
fr: Rappelez-vous que d'autres filtres UNIX peuvent également être utilisés. Vous-êtes vous déjà demandé qui est le développeur Debian le plus actif d'après le nombre de paquets source maintenus ? Il suffit d'avoir une copie du dernier fichier I<Sources> de n'importe quel miroir Debian.

source: This example shows a neat trick: if you want to selectively show only some field of I<all> packages, just supply an empty pattern.
de: Dieses Beispiel zeigt einen eleganten Trick: Falls Sie nur einige ausgewählte Felder von I<allen> Paketen anzeigen möchten, geben Sie nur ein leeres Muster an.
fr: Cet exemple montre une astuce : si vous voulez montrer de façon selective seulement certains champs de I<tous> les paquets, il suffit de fournir un motif vide.

source: The term "bogopackage" means the count of the packages that a Debian developer maintains. To get the bogopackage count for the maintainer of B<dctrl-tools>, say
de: Der Begriff »bogopackage« bedeutet die Anzahl der Pakete, die ein Debian-Entwickler betreut. Um die Anzahl der Bogopackages für den Betreuer von B<dctrl-tools> erhalten, geben Sie Folgendes ein:
fr: Le terme « bogopaquet » signifie le décompte de paquets qu'un développeur Debian maintient. Pour obtenir par exemple le décompte de bogopaquet pour le responsable de B<dctrl-tools>, exécuter

source: Sometimes it is useful to output the data of several fields on the same line. For example, the following command outputs the list of installed packages, sorted by their B<Installed-Size>.
de: Manchmal ist es nützlich, die Daten mehrerer Felder in der gleichen Zeile auszugeben. Der folgende Befehl gibt zum Beispiel die Liste der installierten Pakete sortiert nach ihrer installierten Größe (B<Installed-Size>) aus.
fr: Parfois, afficher les données de plusieurs champs sur une seule ligne est pratique. Par exemple, la commande suivante affiche la liste des paquets installés, triés en fonction de B<Installed-Size>.

source: Note that there should be exactly 2 spaces in the " \en" string.
de: Beachten Sie, dass in der Zeichenkette » \en« genau zwei Leerzeichen sein sollten.
fr: Remarquez qu'il y a exactement deux espaces dans la chaîne " \en".

source: Another usual use-case is looking for packages that have another one as build dependency:
de: Ein anderer häufiger Anwendungsfall ist die Suche nach Paketen, die noch eine andere Bauabhängigkeit haben:
fr: Un autre cas d'utilisation classique est de chercher les paquets qui en ont un autre dans leurs dépendances de construction.

source: These examples cover a lot of typical uses of this utility, but not all possible uses. Use your imagination! The building blocks are there, and if something's missing, let me know.
de: Diese Beispiele decken viele typische Verwendungsmöglichkeiten dieses Hilfswerkzeugs ab, aber nicht alle möglichen Anwendungen. Benutzen Sie Ihre Fantasie! Die Teile des Puzzles sind da und wenn sie etwas vermissen, melden Sie es.
fr: Ces exemples couvrent beaucoup d'utilisations typiques de cet utilitaire, mais pas toutes les utilisations possibles. Soyez imaginatifs ! Les fondations sont là, et s'il manque quelque chose, faites-le moi savoir.

source: DIAGNOSTICS
de: DIAGNOSE

source: In the absence of errors, the exit code B<0> is used if at least one match was found, and the exit code B<1> is used if no matches were found. If there were errors, the exit code is B<2>, with one exception. If the B<-q>, B<--quiet> or B<--silent> options are used, the exit code B<0> is used when a match is found regardless of whether there have been non-fatal errors.
de: Wenn es keine Fehler gibt, wird der Rückgabewert B<0> verwandt, falls mindestens eine Entsprechung gefunden wurde. Falls nichts gefunden wurde, wird der Rückgabewert B<1> benutzt. Falls es Fehler gab, wird der Rückgabewert B<1> genommen, mit einer Ausnahme. Falls die Optionen B<-q>, B<--quiet> oder B<--silent> eingesetzt werden, wird der Rückgabewert B<0> verwandt, wenn es einen Treffer gab, unabhängig davon, ob es schwerwiegende Fehler gab.
fr: En absence d'erreurs, le code de retour B<0> est utilisé si au moins une correspondance a été trouvée, et le code de retour B<1> est utilisé si aucune correspondance n'a été trouvée. En cas d'erreur, le code de retour est B<2>, à une exception. Si les options B<-q>, B<--quiet> ou B<--silent> sont utilisées, le code de retour B<0> est utilisé quand une correspondance est trouvée même s'il y a eu des erreurs non fatales.

source: These messages are emitted in log levels B<fatal> and B<important>. Additional messages may be provided by the system libraries. B<This list is incomplete.>
de: Diese Nachrichten werden in den Protokollierungsstufen B<fatal> und B<important> ausgegeben. Zusätzliche Nachrichten werden von den Systembibliotheken bereitgestellt. B<Diese Liste ist unvollständig.>
fr: Ces messages sont émis dans les niveaux de journalisation B<fatal> et B<important>. Des messages complémentaires peuvent être fournis par les bibliothèques du système. B<Cette liste est incomplète.>

source: B<A pattern is mandatory>
de: B<Ein Muster ist zwingend notwendig.>
fr: B<Un motif est obligatoire>

source: You must specify a pattern to be searched for.
de: Sie müssen ein Muster angeben, nach dem gesucht wird.
fr: Vous devez indiquer un motif à rechercher.

source: B<a predicate is required>
de: B<Ein Prädikat wird benötigt.>
fr: B<un prédicat est nécessaire>

source: No predicate was specified, but one is required.
de: Es wurde kein Prädikat angegeben, es ist aber eins erforderlich.
fr: Aucun filtre n'a été indiqué, alors que c'est nécessaire.

source: B<cannot find enough memory>
de: B<Speicher reicht nicht aus>
fr: B<impossible de trouver suffisamment de mémoire>

source: More memory was needed than was available. This error may be transient, that is, if you try again, all may go well.
de: Es wird mehr Speicher benötigt, als vorhanden ist. Dieser Fehler ist vorübergehend, das heißt, falls Sie es erneut versuchen, könnte alles klappen.
fr: Plus de mémoire que disponible était nécessaire. Ce peut être une erreur passagère, ainsi, en recommençant, elle peut ne pas réapparaître.

source: B<cannot suppress field names when showing whole paragraphs>
de: B<Bei der Anzeige ganzer Absätze können Feldnamen nicht unterdrückt werden.
fr: B<impossible de supprimer les noms de champs lors de l'affichage complet des paragraphes>

source: When you do not use the B<-s> switch, B<grep-dctrl> just passes the matching paragraphs through, not touching them any way. This means, for example, that you can only use B<-n> when you use B<-s>.
de: Wenn Sie nicht den Schalter B<-s> nutzen, reicht B<grep-dctrl> nur die passenden Absätze durch, ohne sie auf irgendeine Art anzufassen. Dies heißt zum Beispiel, dass Sie nur B<-n> verwenden können, wenn Sie Gebrauch von B<-s> machen.
fr: Si vous n'utilisez pas l'option B<-s>, B<grep-dctrl> transmet simplement les paragraphes correspondants, sans les modifier du tout. Cela signifie, par exemple, que vous ne pouvez utiliser l'option B<-n> qu'avec l'option B<-s>.

source: B<inconsistent atom modifiers>
de: <inkonsistente Suchteilbestimmungswörter>
fr: B<modificateurs d'atome incohérents>
