Repository: ajkaijanaho/dctrl-tools
Catalog: man/po4a/po/*.po
Languages: de, fr

source: If all requested columns have a specified width, B<tbl-dctrl> will produce output immediately, not waiting for the whole input to be read in.
de: Falls alle angeforderten Spalten eine angegebene Breite haben, wird B<tbl-dctrl> die Ausgabe sofort erzeugen, ohne darauf zu warten, dass die ganze Eingabe eingelesen ist.
fr: Si toutes les colonnes demandées ont une largeur indiquée, B<tbl-dctrl> affichera le résultat directement, sans attendre d'avoir lu toute l'entrée.

source: B<-d >I<delimiter>, B<--delimiter=>I<delimiter>
de: B<-d >I<Trennzeichen>, B<--delimiter=>I<Trennzeichen>
fr: B<-d >I<délimiteur>, B<--delimiter=>I<délimiteur>

source: Instead of drawing nice borders to the table, use the specified I<delimiter> string to delimit columns in a row.
de: benutzt statt hübschen Rahmen um die Tabelle die angegebene Zeichenkette I<Trennzeichen> um Spalten in einer Zeile voneinander zu trennen.
fr: Au lieu de dessiner de jolis cadres pour le tableau, utiliser le I<délimiteur> indiqué pour séparer les colonnes sur chaque ligne.

source: Do not print a table heading (column titles).
de: druckt keine Tabellenkopfzeilen (Spaltentitel).
fr: Ne pas afficher d'en-tête (titres de colonne).

source: B<tbl-dctrl> will read its input from the files named on the command line, in the specified order.
de: B<tbl-dctrl> wird seine Eingabe aus den auf der Befehlszeile benannten Dateinamen in der angegebenen Reihenfolge lesen.
fr: B<tbl-dctrl> lira son entrée à partir des fichier nommées sur la ligne de commande, dans l'ordre indiqué.

source: If no files are named, the program behaves as if B<-> alone had been named, that is, input is read from the standard input stream.
de: Falls keine Dateien benannt wurden, verhält sich das Programm, als wäre nur allein B<-> genannt worden, das heißt, die Eingabe wird vom Standardeingabe-Datenstrom gelesen.
fr: Si aucun fichier n'est indiqué, le programme se comporte comme si seul B<-> avait été nommé, c'est à dire que l'entrée est lue depuis le flux d'entrée standard.

source: All input to B<tbl-dctrl> is in the format of a Debian control file.
de: Jegliche Eingabe für B<tbl-dctrl> liegt im Format einer Debian-Steuerdatei vor.
fr: Toutes les entrées de B<tbl-dctrl> sont au format d'un fichier de contrôle Debian.

source: When input is read from multiple files, a record separator is implicit between two adjacent files.
de: Wenn die Eingabe aus mehreren Dateien gelesen wird, ist implizit zwischen zwei angrenzenden Dateien ein Datensatztrenner.
fr: Quand l'entrée est lue depuis plusieurs fichiers, un séparateur est implicite entre deux fichiers adjacent.

source: The output is a tabular representation of the input database restricted to the specified fields. Logically, the output is a table; when the B<-d> option is used, this table is represented simply by separating columns in each row by the specified I<delimiter>; when the option is not used, a frame is drawn around the table. The order of the columns is the same as the order of the column specifications on the command line.
de: Die Ausgabe ist eine tabellarische Darstellung der Eingabedatenbank, beschränkt auf die angegebenen Felder. Logischerweise ist die Ausgabe ebenfalls eine Tabelle. Wenn die Option B<-d> verwandt wird, wird diese Tabelle einfach durch Trennung der Spalten in jeder Zeile durch das angegebene I<Trennzeichen> dargestellt; wenn die Option nicht benutzt wird, wird ein Rahmen um die Tabelle gezeichnet. Die Reihenfolge der Spalten ist die Gleiche, wie die der Spaltenangaben auf der Befehlszeile.
fr: La sortie est un tableau qui représente la base de donnée en entrée limitée aux champs indiqués. Lorsque l'option B<-d> est utilisée, le tableau est simplement représentée en séparant les colonnes de chaque ligne par le I<délimiteur> indiqué, sinon, un cadre est dessiné autour du tableau. L'ordre des colonnes est le même que l'ordre des spécifications de colonne sur la ligne de commande.

source: The following command line pipe outputs a table of all packages, with their maintainer data, sorted by the maintainer data, that have no content:
de: Die folgende Befehlszeilen-Pipe gibt eine Tabelle aller Pakete mit ihren Betreuerdaten aus, sortiert nach den Betreuerdaten, die keinen Inhalt haben:
fr: La commande suivante renvoie le tableau de tous les paquets sans contenu, avec leur responsable, ordonnés par responsable.

source: The B<tbl-dctrl> program and this manual page were written by Antti-Juhani Kaijanaho.
de: Das Programm B<tbl-dctrl> und diese Handbuchseite wurden von Antti-Juhani Kaijanaho geschrieben.
fr: Le programme B<tbl-dctrl> et cette page de manuel ont été écrits par Antti-Juhani Kaijanaho.

source: B<ara>(1), B<apt-cache>(1), B<dpkg>(8), B<dpkg-awk>(1), B<dpkg-query>(1), B<grep-dctrl>(1), B<sort-dctrl>(1)
de: B<apt-cache>(1), B<ara>(1), B<dpkg-awk>(1), B<dpkg-query>(1), B<grep-dctrl>(1), B<sort-dctrl>(1), B<dpkg>(8)

source: % grep-available -F Description foo
fr: % grep-available -F Description bidule

source: % grep-available -F Description -i foo
fr: % grep-available -F Description -i bidule

source: % grep-available -P foo
fr: % grep-available -P bidule

source: % grep-available -P -F Description foo
fr: % grep-available -P -F Description bidule

source: % grep-available -F Package -F Description foo
fr: % grep-available -F Package -F Description bidule

source: % grep-dctrl -n -s Maintainer '' Sources | sort | \e uniq -c | sort -nr
fr: % grep-dctrl -n -s Maintainer \(aq\(aq Sources | sort | \e uniq -c | sort -nr

source: EXIT STATUS
fr: CODE DE RETOUR

source: B<sort-dctrl> --copying | --help | --version | -ChV
fr: B<sort-dctrl> B<--copying> | B<--help> | B<--version> | B<-ChV>
